local ActorTable = {
	[101000001] = {
		['ID'] = 101000001,	--索引
		['WeaponId'] = 103010101,	--初始武器
		['HairResId'] = {103010201},	--初始头饰
		['ResId'] = {103010301},	--初始时装
		['InitialHead'] = 105900001,	--角色初始头像
		['BaseAttribute'] = 102001001,	--初始1级属性
		['Skill'] = {111100101,111100102,111100103,111100104,111100105,111100106},	--主动技能
		['PassiveSkill'] = {0},	--被动技能
		['AttributeWu'] = 9	--五行属性
		},
	[101000002] = {
		['ID'] = 101000002,
		['WeaponId'] = 103020101,
		['HairResId'] = {103020201},
		['ResId'] = {103020301},
		['InitialHead'] = 105900003,
		['BaseAttribute'] = 102002001,
		['Skill'] = {111100201,111100202,111100203,111100204,111100205,111100206},
		['PassiveSkill'] = {112300002},
		['AttributeWu'] = 8
		},
	[101000003] = {
		['ID'] = 101000003,
		['WeaponId'] = 103030101,
		['HairResId'] = {103030201},
		['ResId'] = {103030301},
		['InitialHead'] = 105900001,
		['BaseAttribute'] = 102003001,
		['Skill'] = {111100301,111100302,111100303,111100304,111100305,111100306},
		['PassiveSkill'] = {0},
		['AttributeWu'] = 5
		},
	[101000004] = {
		['ID'] = 101000004,
		['WeaponId'] = 103040101,
		['HairResId'] = {103040201},
		['ResId'] = {103040301},
		['InitialHead'] = 105900003,
		['BaseAttribute'] = 102004001,
		['Skill'] = {111100401,111100402,111100403,111100404,111100405,111100406},
		['PassiveSkill'] = {111100039},
		['AttributeWu'] = 6
		},
	[101000005] = {
		['ID'] = 101000005,
		['WeaponId'] = 103040101,
		['HairResId'] = {103040201},
		['ResId'] = {103040301},
		['InitialHead'] = 105900003,
		['BaseAttribute'] = 102004001,
		['Skill'] = {111100401,111100402,111100403,111100404,111100405,111100406},
		['PassiveSkill'] = {0},
		['AttributeWu'] = 7
		}
	}
return ActorTable
