local ErrorBoxTable = {
	[190100001] = {
		['ID'] = 190100001,	--索引
		['Type'] = 1,	--显示类型
		['Text'] = '服务器维护中无法登陆',	--显示内容
		['SystemChannel'] = 0	--系统频道显示
		},
	[190100002] = {
		['ID'] = 190100002,
		['Type'] = 1,
		['Text'] = '无法连接服务器，请检查网络状况后再尝试登陆',
		['SystemChannel'] = 0
		},
	[190100003] = {
		['ID'] = 190100003,
		['Type'] = 1,
		['Text'] = '客户端版本与服务器不符，请更新至最新版客户端',
		['SystemChannel'] = 0
		},
	[190100004] = {
		['ID'] = 190100004,
		['Type'] = 2,
		['Text'] = '[536C85]断开连接，请重新登陆',
		['SystemChannel'] = 0
		},
	[190100005] = {
		['ID'] = 190100005,
		['Type'] = 1,
		['Text'] = '您输入的名字已存在',
		['SystemChannel'] = 0
		},
	[190100006] = {
		['ID'] = 190100006,
		['Type'] = 1,
		['Text'] = '创建角色失败，请尝试重新创建',
		['SystemChannel'] = 0
		},
	[190100007] = {
		['ID'] = 190100007,
		['Type'] = 1,
		['Text'] = '您输入的姓名过短',
		['SystemChannel'] = 0
		},
	[190100008] = {
		['ID'] = 190100008,
		['Type'] = 1,
		['Text'] = '角色姓名包含非法字符',
		['SystemChannel'] = 0
		},
	[190100009] = {
		['ID'] = 190100009,
		['Type'] = 1,
		['Text'] = '您输入的名称过长',
		['SystemChannel'] = 0
		},
	[190100010] = {
		['ID'] = 190100010,
		['Type'] = 1,
		['Text'] = '战斗状态无法上坐骑',
		['SystemChannel'] = 0
		},
	[190100011] = {
		['ID'] = 190100011,
		['Type'] = 1,
		['Text'] = '战斗状态无法传送',
		['SystemChannel'] = 0
		},
	[190100012] = {
		['ID'] = 190100012,
		['Type'] = 1,
		['Text'] = '障碍物阻挡',
		['SystemChannel'] = 0
		},
	[190100013] = {
		['ID'] = 190100013,
		['Type'] = 4,
		['Text'] = '队伍已解散，无法加入队伍',
		['SystemChannel'] = 0
		},
	[190100014] = {
		['ID'] = 190100014,
		['Type'] = 1,
		['Text'] = '未加入门宗，无法发言',
		['SystemChannel'] = 0
		},
	[190100015] = {
		['ID'] = 190100015,
		['Type'] = 2,
		['Text'] = '[536C85]账号名不能为空',
		['SystemChannel'] = 0
		},
	[190200001] = {
		['ID'] = 190200001,
		['Type'] = 4,
		['Text'] = '您获得了%s×%d',
		['SystemChannel'] = 0
		},
	[190200002] = {
		['ID'] = 190200002,
		['Type'] = 4,
		['Text'] = '您出售了[40f765]%d[-]个%s',
		['SystemChannel'] = 0
		},
	[190200003] = {
		['ID'] = 190200003,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]银票',
		['SystemChannel'] = 1
		},
	[190200004] = {
		['ID'] = 190200004,
		['Type'] = 4,
		['Text'] = '您获得了[f69e40]%d[-]元宝',
		['SystemChannel'] = 1
		},
	[190200005] = {
		['ID'] = 190200005,
		['Type'] = 1,
		['Text'] = '您的元宝不足%d，请充值~',
		['SystemChannel'] = 0
		},
	[190200006] = {
		['ID'] = 190200006,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]经验',
		['SystemChannel'] = 1
		},
	[190300001] = {
		['ID'] = 190300001,
		['Type'] = 5,
		['Text'] = 'exp+%d',
		['SystemChannel'] = 0
		},
	[190300002] = {
		['ID'] = 190300002,
		['Type'] = 5,
		['Text'] = 'money+%d',
		['SystemChannel'] = 0
		},
	[190300003] = {
		['ID'] = 190300003,
		['Type'] = 1,
		['Text'] = '扩充背包成功',
		['SystemChannel'] = 1
		},
	[190300004] = {
		['ID'] = 190300004,
		['Type'] = 1,
		['Text'] = '您没有足够的[40f765]银票[-]扩充背包格子',
		['SystemChannel'] = 0
		},
	[190300005] = {
		['ID'] = 190300005,
		['Type'] = 3,
		['Text'] = '[536C85]是否将%s全部合并成[eb5032]禁止交易[-]的物品?',
		['SystemChannel'] = 0
		},
	[190300006] = {
		['ID'] = 190300006,
		['Type'] = 3,
		['Text'] = '[536C85]是否花费[2c9124]%d[-]银票解锁5个格子',
		['SystemChannel'] = 0
		},
	[190300007] = {
		['ID'] = 190300007,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法提交任务',
		['SystemChannel'] = 0
		},
	[190300008] = {
		['ID'] = 190300008,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法使用道具',
		['SystemChannel'] = 0
		},
	[190300009] = {
		['ID'] = 190300009,
		['Type'] = 1,
		['Text'] = '背包空位不足，道具以邮件形式发送',
		['SystemChannel'] = 0
		},
	[190300010] = {
		['ID'] = 190300010,
		['Type'] = 1,
		['Text'] = '道具已到期无法使用',
		['SystemChannel'] = 0
		},
	[190300011] = {
		['ID'] = 190300011,
		['Type'] = 1,
		['Text'] = '您的[50b7d7]改名卡[-]不足，请前往[40f765]商城[-]购买',
		['SystemChannel'] = 0
		},
	[190300012] = {
		['ID'] = 190300012,
		['Type'] = 4,
		['Text'] = '您的名字修改成功',
		['SystemChannel'] = 0
		},
	[190300013] = {
		['ID'] = 190300013,
		['Type'] = 4,
		['Text'] = '修改头像成功',
		['SystemChannel'] = 0
		},
	[190300014] = {
		['ID'] = 190300014,
		['Type'] = 4,
		['Text'] = '您的等级不足[eb5032]%s[-]，无法使用传送点',
		['SystemChannel'] = 0
		},
	[190300015] = {
		['ID'] = 190300015,
		['Type'] = 4,
		['Text'] = '您的等级不足[eb5032]%s[-]，无法传送进入地图',
		['SystemChannel'] = 0
		},
	[190300016] = {
		['ID'] = 190300016,
		['Type'] = 1,
		['Text'] = '背包空位不足，购买失败',
		['SystemChannel'] = 0
		},
	[190300017] = {
		['ID'] = 190300017,
		['Type'] = 1,
		['Text'] = '等级不足[eb5032]%s[-]级，无法切换PK模式',
		['SystemChannel'] = 0
		},
	[190300018] = {
		['ID'] = 190300018,
		['Type'] = 4,
		['Text'] = '已切换到[40f765]和平[-]模式',
		['SystemChannel'] = 0
		},
	[190300019] = {
		['ID'] = 190300019,
		['Type'] = 1,
		['Text'] = '当前处于切磋状态无法切换模式',
		['SystemChannel'] = 0
		},
	[190300020] = {
		['ID'] = 190300020,
		['Type'] = 3,
		['Text'] = '[536C85]缺少[f69e40]狂暴丹[-]无法切换到杀戮模式，是否需要前往[2c9124]商城[-]购买？',
		['SystemChannel'] = 0
		},
	[190300021] = {
		['ID'] = 190300021,
		['Type'] = 1,
		['Text'] = '[eb5032]%s[-]秒后才能切换到[65cd59]和平[-]模式',
		['SystemChannel'] = 0
		},
	[190300022] = {
		['ID'] = 190300022,
		['Type'] = 1,
		['Text'] = '安全区内无法切换模式',
		['SystemChannel'] = 0
		},
	[190300023] = {
		['ID'] = 190300023,
		['Type'] = 1,
		['Text'] = '阵营区域无法切换模式',
		['SystemChannel'] = 0
		},
	[190300024] = {
		['ID'] = 190300024,
		['Type'] = 4,
		['Text'] = '您揉虐了[eb5032]%s[-]',
		['SystemChannel'] = 0
		},
	[190300025] = {
		['ID'] = 190300025,
		['Type'] = 4,
		['Text'] = '您被[eb5032]%s[-]揉虐了',
		['SystemChannel'] = 0
		},
	[190300026] = {
		['ID'] = 190300026,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]在%s被[eb5032]%s[-]残忍的揉虐了',
		['SystemChannel'] = 0
		},
	[190300027] = {
		['ID'] = 190300027,
		['Type'] = 1,
		['Text'] = '未结束切磋前不可再次发起切磋',
		['SystemChannel'] = 0
		},
	[190300028] = {
		['ID'] = 190300028,
		['Type'] = 1,
		['Text'] = '目标正处于切磋状态',
		['SystemChannel'] = 0
		},
	[190300029] = {
		['ID'] = 190300029,
		['Type'] = 1,
		['Text'] = '切磋双方的PK模式必须都为和平模式',
		['SystemChannel'] = 0
		},
	[190300030] = {
		['ID'] = 190300030,
		['Type'] = 1,
		['Text'] = '当前地图无法进行切磋',
		['SystemChannel'] = 0
		},
	[190300031] = {
		['ID'] = 190300031,
		['Type'] = 1,
		['Text'] = '切磋双方不能处于安全区内',
		['SystemChannel'] = 0
		},
	[190300032] = {
		['ID'] = 190300032,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]向你发起切磋邀请，是否应战',
		['SystemChannel'] = 0
		},
	[190300033] = {
		['ID'] = 190300033,
		['Type'] = 1,
		['Text'] = '超出切磋范围，[eb5032]%s[-]秒后会被判定切磋失败',
		['SystemChannel'] = 0
		},
	[190300034] = {
		['ID'] = 190300034,
		['Type'] = 4,
		['Text'] = '您在切磋中击败了[00ff00]%s[-]',
		['SystemChannel'] = 0
		},
	[190300035] = {
		['ID'] = 190300035,
		['Type'] = 4,
		['Text'] = '您在切磋中被[00ff00]%s[-]击败了',
		['SystemChannel'] = 0
		},
	[190300036] = {
		['ID'] = 190300036,
		['Type'] = 1,
		['Text'] = '已达任务数量上限，请完成当前任务再进行接取！',
		['SystemChannel'] = 0
		},
	[190400001] = {
		['ID'] = 190400001,
		['Type'] = 1,
		['Text'] = '您输入的文字内容过长，请减少后再输入',
		['SystemChannel'] = 0
		},
	[190400002] = {
		['ID'] = 190400002,
		['Type'] = 1,
		['Text'] = '需要[eb5032]%s[-]级或以上时才能发言',
		['SystemChannel'] = 0
		},
	[190400003] = {
		['ID'] = 190400003,
		['Type'] = 1,
		['Text'] = '请您等候[eb5032]%s[-]秒后再发言',
		['SystemChannel'] = 0
		},
	[190400004] = {
		['ID'] = 190400004,
		['Type'] = 1,
		['Text'] = '不能发送空消息',
		['SystemChannel'] = 0
		},
	[190400005] = {
		['ID'] = 190400005,
		['Type'] = 1,
		['Text'] = '您的元宝不足',
		['SystemChannel'] = 0
		},
	[190400006] = {
		['ID'] = 190400006,
		['Type'] = 1,
		['Text'] = '您的道具不足，无法发送广播',
		['SystemChannel'] = 0
		},
	[190400007] = {
		['ID'] = 190400007,
		['Type'] = 4,
		['Text'] = '发送广播成功',
		['SystemChannel'] = 0
		},
	[190410001] = {
		['ID'] = 190410001,
		['Type'] = 1,
		['Text'] = '您的精力不足，无法制造',
		['SystemChannel'] = 0
		},
	[190410002] = {
		['ID'] = 190410002,
		['Type'] = 1,
		['Text'] = '您的背包空位不足，无法制造',
		['SystemChannel'] = 0
		},
	[190410003] = {
		['ID'] = 190410003,
		['Type'] = 1,
		['Text'] = '每日使用技能书升级已达上限',
		['SystemChannel'] = 0
		},
	[190410004] = {
		['ID'] = 190410004,
		['Type'] = 1,
		['Text'] = '缺少对应的生活技能书，无法升级',
		['SystemChannel'] = 0
		},
	[190410005] = {
		['ID'] = 190410005,
		['Type'] = 1,
		['Text'] = '您的帮贡或银两不足，无法升级',
		['SystemChannel'] = 0
		},
	[190410006] = {
		['ID'] = 190410006,
		['Type'] = 1,
		['Text'] = '角色等级不足，无法突破',
		['SystemChannel'] = 0
		},
	[190410007] = {
		['ID'] = 190410007,
		['Type'] = 1,
		['Text'] = '道具不足，无法突破',
		['SystemChannel'] = 0
		},
	[190410008] = {
		['ID'] = 190410008,
		['Type'] = 1,
		['Text'] = '升级成功！',
		['SystemChannel'] = 0
		},
	[190411001] = {
		['ID'] = 190411001,
		['Type'] = 1,
		['Text'] = '门宗活动期间内，无法开除门宗成员',
		['SystemChannel'] = 0
		},
	[190411002] = {
		['ID'] = 190411002,
		['Type'] = 1,
		['Text'] = '当前非活动时间，无法进入',
		['SystemChannel'] = 0
		},
	[190411003] = {
		['ID'] = 190411003,
		['Type'] = 1,
		['Text'] = '未获得帮战决赛资格，无法进入',
		['SystemChannel'] = 0
		},
	[190411004] = {
		['ID'] = 190411004,
		['Type'] = 1,
		['Text'] = '帮战尚未开始，尚无战绩',
		['SystemChannel'] = 0
		},
	[190411005] = {
		['ID'] = 190411005,
		['Type'] = 1,
		['Text'] = '成员召集CD中，请稍后再试',
		['SystemChannel'] = 0
		},
	[190411006] = {
		['ID'] = 190411006,
		['Type'] = 1,
		['Text'] = '门宗活动期间无法踢人',
		['SystemChannel'] = 0
		},
	[190500001] = {
		['ID'] = 190500001,
		['Type'] = 4,
		['Text'] = '您成为了队长',
		['SystemChannel'] = 0
		},
	[190500002] = {
		['ID'] = 190500002,
		['Type'] = 1,
		['Text'] = '当前场景无法使用组队功能',
		['SystemChannel'] = 0
		},
	[190500003] = {
		['ID'] = 190500003,
		['Type'] = 1,
		['Text'] = '组队状态无法进入',
		['SystemChannel'] = 0
		},
	[190500004] = {
		['ID'] = 190500004,
		['Type'] = 3,
		['Text'] = '[536C85]您确认离开队伍吗',
		['SystemChannel'] = 0
		},
	[190500005] = {
		['ID'] = 190500005,
		['Type'] = 4,
		['Text'] = '您离开了[00ff00]%s[-]的队伍',
		['SystemChannel'] = 0
		},
	[190500006] = {
		['ID'] = 190500006,
		['Type'] = 4,
		['Text'] = '您的喊话已发送，请耐心等待其他玩家加入',
		['SystemChannel'] = 0
		},
	[190500007] = {
		['ID'] = 190500007,
		['Type'] = 1,
		['Text'] = '请在[eb5032]%s[-]秒后再进行一键喊话',
		['SystemChannel'] = 0
		},
	[190500008] = {
		['ID'] = 190500008,
		['Type'] = 3,
		['Text'] = '[536C85]成功加入队伍，即将自动跟随队长',
		['SystemChannel'] = 0
		},
	[190500009] = {
		['ID'] = 190500009,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]拒绝跟随队长',
		['SystemChannel'] = 0
		},
	[190500010] = {
		['ID'] = 190500010,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]加入了队伍',
		['SystemChannel'] = 0
		},
	[190500011] = {
		['ID'] = 190500011,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]成为了队长',
		['SystemChannel'] = 0
		},
	[190500012] = {
		['ID'] = 190500012,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]被您请离了队伍',
		['SystemChannel'] = 0
		},
	[190500013] = {
		['ID'] = 190500013,
		['Type'] = 4,
		['Text'] = '您被[00ff00]%s[-]请离了队伍',
		['SystemChannel'] = 0
		},
	[190500014] = {
		['ID'] = 190500014,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]离开了队伍',
		['SystemChannel'] = 0
		},
	[190500015] = {
		['ID'] = 190500015,
		['Type'] = 1,
		['Text'] = '副本正在战斗，无法传送进入',
		['SystemChannel'] = 0
		},
	[190500016] = {
		['ID'] = 190500016,
		['Type'] = 4,
		['Text'] = '已向队长发送申请，请耐心等待',
		['SystemChannel'] = 0
		},
	[190500017] = {
		['ID'] = 190500017,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]申请成为队长，是否同意',
		['SystemChannel'] = 0
		},
	[190500018] = {
		['ID'] = 190500018,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]不在队伍，指令无效',
		['SystemChannel'] = 0
		},
	[190500019] = {
		['ID'] = 190500019,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]拒绝了您的带队申请，请稍候再试',
		['SystemChannel'] = 0
		},
	[190500020] = {
		['ID'] = 190500020,
		['Type'] = 1,
		['Text'] = '您的申请过于频繁，请在[eb5032]%s[-]秒后再试',
		['SystemChannel'] = 0
		},
	[190500021] = {
		['ID'] = 190500021,
		['Type'] = 4,
		['Text'] = '您加入了[00ff00]%s[-]的队伍',
		['SystemChannel'] = 0
		},
	[190500022] = {
		['ID'] = 190500022,
		['Type'] = 3,
		['Text'] = '[536C85]队伍正在[50b7d7]%s[-]副本进程中，是否同意进入副本',
		['SystemChannel'] = 0
		},
	[190500023] = {
		['ID'] = 190500023,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]处于离线状态，指令无效',
		['SystemChannel'] = 0
		},
	[190500024] = {
		['ID'] = 190500024,
		['Type'] = 1,
		['Text'] = '队伍已满，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500025] = {
		['ID'] = 190500025,
		['Type'] = 1,
		['Text'] = '队伍已解散，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500026] = {
		['ID'] = 190500026,
		['Type'] = 1,
		['Text'] = '队伍等级不符，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500027] = {
		['ID'] = 190500027,
		['Type'] = 1,
		['Text'] = '队伍已满，无法加入更多队员',
		['SystemChannel'] = 0
		},
	[190500028] = {
		['ID'] = 190500028,
		['Type'] = 3,
		['Text'] = '[536C85]是否重新加入快速组队系统匹配',
		['SystemChannel'] = 0
		},
	[190500029] = {
		['ID'] = 190500029,
		['Type'] = 1,
		['Text'] = '当前系统推荐活动已全部完成',
		['SystemChannel'] = 0
		},
	[190500030] = {
		['ID'] = 190500030,
		['Type'] = 4,
		['Text'] = '您的邀请已发送，请耐心等待',
		['SystemChannel'] = 0
		},
	[190500031] = {
		['ID'] = 190500031,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]邀请您加入队伍，目标：[2c9124]%d[-]，是否同意',
		['SystemChannel'] = 0
		},
	[190500032] = {
		['ID'] = 190500032,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]拒绝了您的邀请',
		['SystemChannel'] = 0
		},
	[190500033] = {
		['ID'] = 190500033,
		['Type'] = 1,
		['Text'] = '对方已在组队状态，无法邀请',
		['SystemChannel'] = 0
		},
	[190500034] = {
		['ID'] = 190500034,
		['Type'] = 1,
		['Text'] = '对方已离线，无法邀请',
		['SystemChannel'] = 0
		},
	[190500035] = {
		['ID'] = 190500035,
		['Type'] = 1,
		['Text'] = '您已在队伍中，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500036] = {
		['ID'] = 190500036,
		['Type'] = 4,
		['Text'] = '升星成功',
		['SystemChannel'] = 0
		},
	[190500037] = {
		['ID'] = 190500037,
		['Type'] = 4,
		['Text'] = '升阶成功',
		['SystemChannel'] = 0
		},
	[190500038] = {
		['ID'] = 190500038,
		['Type'] = 4,
		['Text'] = '附魔成功',
		['SystemChannel'] = 0
		},
	[190500039] = {
		['ID'] = 190500039,
		['Type'] = 4,
		['Text'] = '剥离成功',
		['SystemChannel'] = 0
		},
	[190500040] = {
		['ID'] = 190500040,
		['Type'] = 4,
		['Text'] = '镶嵌成功',
		['SystemChannel'] = 0
		},
	[190500041] = {
		['ID'] = 190500041,
		['Type'] = 4,
		['Text'] = '合成成功',
		['SystemChannel'] = 0
		},
	[190500042] = {
		['ID'] = 190500042,
		['Type'] = 3,
		['Text'] = '[536C85]此活动需单人参加,您目前处于队伍中，是否退出队伍参加活动？',
		['SystemChannel'] = 0
		},
	[190500043] = {
		['ID'] = 190500043,
		['Type'] = 3,
		['Text'] = '[536C85]离开副本将重置副本，你确定要离开吗？',
		['SystemChannel'] = 0
		},
	[190500044] = {
		['ID'] = 190500044,
		['Type'] = 1,
		['Text'] = '当前场景无法骑乘坐骑',
		['SystemChannel'] = 0
		},
	[190500045] = {
		['ID'] = 190500045,
		['Type'] = 1,
		['Text'] = '当前场景无法进行传送',
		['SystemChannel'] = 0
		},
	[190500046] = {
		['ID'] = 190500046,
		['Type'] = 1,
		['Text'] = '您没有队伍，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500047] = {
		['ID'] = 190500047,
		['Type'] = 1,
		['Text'] = '队伍人数不符合，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500048] = {
		['ID'] = 190500048,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]不在线，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500049] = {
		['ID'] = 190500049,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]处于死亡状态，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500050] = {
		['ID'] = 190500050,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]距离过远，是否召唤队员集合',
		['SystemChannel'] = 0
		},
	[190500051] = {
		['ID'] = 190500051,
		['Type'] = 3,
		['Text'] = '[536C85]队长召唤全体队员集合，是否立刻前往？',
		['SystemChannel'] = 0
		},
	[190500052] = {
		['ID'] = 190500052,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]拒绝集合',
		['SystemChannel'] = 0
		},
	[190500053] = {
		['ID'] = 190500053,
		['Type'] = 1,
		['Text'] = '您不是队长，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500054] = {
		['ID'] = 190500054,
		['Type'] = 3,
		['Text'] = '[536C85]收益次数为0，无法获得任何收益，是否确认进入',
		['SystemChannel'] = 0
		},
	[190500055] = {
		['ID'] = 190500055,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]等级不足无法进入',
		['SystemChannel'] = 0
		},
	[190500056] = {
		['ID'] = 190500056,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]银两不足无法进入',
		['SystemChannel'] = 0
		},
	[190500057] = {
		['ID'] = 190500057,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]元宝不足无法进入',
		['SystemChannel'] = 0
		},
	[190500058] = {
		['ID'] = 190500058,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]缺少%s道具无法进入',
		['SystemChannel'] = 0
		},
	[190500059] = {
		['ID'] = 190500059,
		['Type'] = 3,
		['Text'] = '[536C85]您在[2c9124]%s[-]被[eb5032]%s[-]残忍的揉虐了,如此奇耻大辱，此仇不报非君子，该怎么办呢？',
		['SystemChannel'] = 0
		},
	[190500060] = {
		['ID'] = 190500060,
		['Type'] = 1,
		['Text'] = '当前场景不允许加入新队员',
		['SystemChannel'] = 0
		},
	[190500061] = {
		['ID'] = 190500061,
		['Type'] = 1,
		['Text'] = '副本已满创建副本失败，请稍候重试',
		['SystemChannel'] = 0
		},
	[190500062] = {
		['ID'] = 190500062,
		['Type'] = 3,
		['Text'] = '[536C85]强制离开副本会先退出队伍，是否确认强制离开副本',
		['SystemChannel'] = 0
		},
	[190500063] = {
		['ID'] = 190500063,
		['Type'] = 4,
		['Text'] = '您当前银币不足',
		['SystemChannel'] = 0
		},
	[190500064] = {
		['ID'] = 190500064,
		['Type'] = 1,
		['Text'] = '队长已离线，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500065] = {
		['ID'] = 190500065,
		['Type'] = 1,
		['Text'] = '对方在副本中，无法邀请',
		['SystemChannel'] = 0
		},
	[190500066] = {
		['ID'] = 190500066,
		['Type'] = 1,
		['Text'] = '队伍在副本中，无法申请入队',
		['SystemChannel'] = 0
		},
	[190500067] = {
		['ID'] = 190500067,
		['Type'] = 4,
		['Text'] = '升级成功',
		['SystemChannel'] = 0
		},
	[190500068] = {
		['ID'] = 190500068,
		['Type'] = 4,
		['Text'] = '技能升级失败，角色等级不足',
		['SystemChannel'] = 0
		},
	[190500069] = {
		['ID'] = 190500069,
		['Type'] = 4,
		['Text'] = '技能达到%d级解锁',
		['SystemChannel'] = 0
		},
	[190500070] = {
		['ID'] = 190500070,
		['Type'] = 4,
		['Text'] = '队长已变更，无法传送',
		['SystemChannel'] = 0
		},
	[190500071] = {
		['ID'] = 190500071,
		['Type'] = 3,
		['Text'] = '[536C85]当前绑定元宝不足，是否使用元宝购买？',
		['SystemChannel'] = 0
		},
	[190500072] = {
		['ID'] = 190500072,
		['Type'] = 1,
		['Text'] = '时装佩戴成功',
		['SystemChannel'] = 0
		},
	[190500073] = {
		['ID'] = 190500073,
		['Type'] = 1,
		['Text'] = '对不起，没有时装可以进行染色',
		['SystemChannel'] = 0
		},
	[190500074] = {
		['ID'] = 190500074,
		['Type'] = 1,
		['Text'] = '没有佩戴当前时装，不能染色',
		['SystemChannel'] = 0
		},
	[190500075] = {
		['ID'] = 190500075,
		['Type'] = 1,
		['Text'] = '对不起，您的染料不足',
		['SystemChannel'] = 0
		},
	[190500076] = {
		['ID'] = 190500076,
		['Type'] = 1,
		['Text'] = '对不起，您的染色剂不足',
		['SystemChannel'] = 0
		},
	[190500077] = {
		['ID'] = 190500077,
		['Type'] = 1,
		['Text'] = '该颜色未开启，请开启颜色后进行染色',
		['SystemChannel'] = 0
		},
	[190500078] = {
		['ID'] = 190500078,
		['Type'] = 1,
		['Text'] = '染色成功',
		['SystemChannel'] = 0
		},
	[190500079] = {
		['ID'] = 190500079,
		['Type'] = 1,
		['Text'] = '颜色开启成功',
		['SystemChannel'] = 0
		},
	[190500080] = {
		['ID'] = 190500080,
		['Type'] = 1,
		['Text'] = '邮件领取成功',
		['SystemChannel'] = 0
		},
	[190500081] = {
		['ID'] = 190500081,
		['Type'] = 1,
		['Text'] = '您的背包空位不足，邮件领取失败',
		['SystemChannel'] = 0
		},
	[190500082] = {
		['ID'] = 190500082,
		['Type'] = 1,
		['Text'] = '邮件删除成功',
		['SystemChannel'] = 0
		},
	[190500083] = {
		['ID'] = 190500083,
		['Type'] = 1,
		['Text'] = '请选择需要染色的颜色',
		['SystemChannel'] = 0
		},
	[190500084] = {
		['ID'] = 190500084,
		['Type'] = 1,
		['Text'] = '对方不在线无法入队',
		['SystemChannel'] = 0
		},
	[190500085] = {
		['ID'] = 190500085,
		['Type'] = 1,
		['Text'] = '对方已有队伍无法入队',
		['SystemChannel'] = 0
		},
	[190500086] = {
		['ID'] = 190500086,
		['Type'] = 1,
		['Text'] = '对方等级不符无法入队',
		['SystemChannel'] = 0
		},
	[190500087] = {
		['ID'] = 190500087,
		['Type'] = 1,
		['Text'] = '所有颜色已开启完毕',
		['SystemChannel'] = 0
		},
	[190500088] = {
		['ID'] = 190500088,
		['Type'] = 1,
		['Text'] = '当前时装已过期',
		['SystemChannel'] = 0
		},
	[190500089] = {
		['ID'] = 190500089,
		['Type'] = 1,
		['Text'] = '武器不能进行染色',
		['SystemChannel'] = 0
		},
	[190500090] = {
		['ID'] = 190500090,
		['Type'] = 1,
		['Text'] = '修灵成功',
		['SystemChannel'] = 0
		},
	[190500091] = {
		['ID'] = 190500091,
		['Type'] = 1,
		['Text'] = '铸灵成功',
		['SystemChannel'] = 0
		},
	[190500092] = {
		['ID'] = 190500092,
		['Type'] = 1,
		['Text'] = '您无法进行升阶，需要[eb5032]%s[-]级',
		['SystemChannel'] = 0
		},
	[190500093] = {
		['ID'] = 190500093,
		['Type'] = 1,
		['Text'] = '当前采集物品不存在',
		['SystemChannel'] = 0
		},
	[190500094] = {
		['ID'] = 190500094,
		['Type'] = 1,
		['Text'] = '您无法进行修灵，需要[eb5032]%s[-]级',
		['SystemChannel'] = 0
		},
	[190500095] = {
		['ID'] = 190500095,
		['Type'] = 1,
		['Text'] = '在阵法旁即可获得经验',
		['SystemChannel'] = 0
		},
	[190500096] = {
		['ID'] = 190500096,
		['Type'] = 1,
		['Text'] = '该幻化坐骑已过期',
		['SystemChannel'] = 0
		},
	[190500097] = {
		['ID'] = 190500097,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法进行采集',
		['SystemChannel'] = 0
		},
	[190500098] = {
		['ID'] = 190500098,
		['Type'] = 1,
		['Text'] = '幻化成功',
		['SystemChannel'] = 0
		},
	[190500099] = {
		['ID'] = 190500099,
		['Type'] = 1,
		['Text'] = '说明说明',
		['SystemChannel'] = 0
		},
	[190600001] = {
		['ID'] = 190600001,
		['Type'] = 1,
		['Text'] = '当前状态无法寻路，请降至地面',
		['SystemChannel'] = 0
		},
	[190600002] = {
		['ID'] = 190600002,
		['Type'] = 1,
		['Text'] = '战斗状态无法上坐骑',
		['SystemChannel'] = 0
		},
	[190600003] = {
		['ID'] = 190600003,
		['Type'] = 1,
		['Text'] = '铸灵道具不足，无法铸灵',
		['SystemChannel'] = 0
		},
	[190500100] = {
		['ID'] = 190500100,
		['Type'] = 1,
		['Text'] = '您的银两不足',
		['SystemChannel'] = 0
		},
	[190500101] = {
		['ID'] = 190500101,
		['Type'] = 1,
		['Text'] = '您的真气不足',
		['SystemChannel'] = 0
		},
	[190500102] = {
		['ID'] = 190500102,
		['Type'] = 1,
		['Text'] = '您的道具不足，无法进行冲穴',
		['SystemChannel'] = 0
		},
	[190500103] = {
		['ID'] = 190500103,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]拥有退出CD，还需要等待[eb5032]%s[-]秒才能再次参加活动',
		['SystemChannel'] = 0
		},
	[190500104] = {
		['ID'] = 190500104,
		['Type'] = 1,
		['Text'] = '活动暂未开启，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500105] = {
		['ID'] = 190500105,
		['Type'] = 1,
		['Text'] = '您不是队长，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500106] = {
		['ID'] = 190500106,
		['Type'] = 1,
		['Text'] = '队伍人数不符，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500107] = {
		['ID'] = 190500107,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]等级不足，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500108] = {
		['ID'] = 190500108,
		['Type'] = 1,
		['Text'] = '新手组阶段无法组队参加活动',
		['SystemChannel'] = 0
		},
	[190500109] = {
		['ID'] = 190500109,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]不在线，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500110] = {
		['ID'] = 190500110,
		['Type'] = 3,
		['Text'] = '[536C85]正在匹配队列中，是否退出？',
		['SystemChannel'] = 0
		},
	[190500111] = {
		['ID'] = 190500111,
		['Type'] = 1,
		['Text'] = '队长已取消匹配',
		['SystemChannel'] = 0
		},
	[190500112] = {
		['ID'] = 190500112,
		['Type'] = 1,
		['Text'] = '队伍模式变更，已退出匹配队列',
		['SystemChannel'] = 0
		},
	[190500113] = {
		['ID'] = 190500113,
		['Type'] = 1,
		['Text'] = '队伍有玩家掉线，已退出匹配队列',
		['SystemChannel'] = 0
		},
	[190500114] = {
		['ID'] = 190500114,
		['Type'] = 1,
		['Text'] = '活动已经结束，无法参加匹配',
		['SystemChannel'] = 0
		},
	[190500115] = {
		['ID'] = 190500115,
		['Type'] = 1,
		['Text'] = '对不起，您的道具不足',
		['SystemChannel'] = 0
		},
	[190500116] = {
		['ID'] = 190500116,
		['Type'] = 1,
		['Text'] = '突破%s穴脉后解锁',
		['SystemChannel'] = 0
		},
	[190500117] = {
		['ID'] = 190500117,
		['Type'] = 1,
		['Text'] = '对不起,您的筑基丹不足',
		['SystemChannel'] = 0
		},
	[190500118] = {
		['ID'] = 190500118,
		['Type'] = 1,
		['Text'] = '当前悬赏活动信息已过期，请刷新后再尝试',
		['SystemChannel'] = 0
		},
	[190500119] = {
		['ID'] = 190500119,
		['Type'] = 1,
		['Text'] = '您没有队伍，无法参与活动',
		['SystemChannel'] = 0
		},
	[190500120] = {
		['ID'] = 190500120,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]已有官府悬赏任务，无法再参与',
		['SystemChannel'] = 0
		},
	[190500121] = {
		['ID'] = 190500121,
		['Type'] = 4,
		['Text'] = '任务完成',
		['SystemChannel'] = 0
		},
	[190500122] = {
		['ID'] = 190500122,
		['Type'] = 4,
		['Text'] = '当前没有可佩带的八卦牌',
		['SystemChannel'] = 0
		},
	[190500123] = {
		['ID'] = 190500123,
		['Type'] = 1,
		['Text'] = '悬赏牌不足，无法进行刷新',
		['SystemChannel'] = 0
		},
	[190500124] = {
		['ID'] = 190500124,
		['Type'] = 1,
		['Text'] = '官府悬赏任务失败，请重新接取',
		['SystemChannel'] = 0
		},
	[190500125] = {
		['ID'] = 190500125,
		['Type'] = 3,
		['Text'] = '[536C85]选为专精需要消耗[f69e40]%d[-]元宝，是否确认选择',
		['SystemChannel'] = 0
		},
	[190500126] = {
		['ID'] = 190500126,
		['Type'] = 1,
		['Text'] = '找不到匹配的玩家',
		['SystemChannel'] = 0
		},
	[190500127] = {
		['ID'] = 190500127,
		['Type'] = 1,
		['Text'] = '此玩家正在被悬赏，无法重复发布',
		['SystemChannel'] = 0
		},
	[190500128] = {
		['ID'] = 190500128,
		['Type'] = 1,
		['Text'] = '悬赏目标为自身，无法发布悬赏',
		['SystemChannel'] = 0
		},
	[190500129] = {
		['ID'] = 190500129,
		['Type'] = 1,
		['Text'] = '玩家等级未达到可被悬赏等级',
		['SystemChannel'] = 0
		},
	[190500130] = {
		['ID'] = 190500130,
		['Type'] = 1,
		['Text'] = '此玩家刚被悬赏不久，短时间内无法对其发布悬赏',
		['SystemChannel'] = 0
		},
	[190500131] = {
		['ID'] = 190500131,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定以[2c9124]%d[-]银两（含手续费）发布对[00ff00]%s[-]的悬赏',
		['SystemChannel'] = 0
		},
	[190500132] = {
		['ID'] = 190500132,
		['Type'] = 1,
		['Text'] = '江湖追杀令已发布，静待佳音',
		['SystemChannel'] = 0
		},
	[190500133] = {
		['ID'] = 190500133,
		['Type'] = 1,
		['Text'] = '您的银两不足无法发布悬赏',
		['SystemChannel'] = 0
		},
	[190500134] = {
		['ID'] = 190500134,
		['Type'] = 3,
		['Text'] = '[536C85]需要交纳[2c9124]%d[-]银两作为押金才能领取该悬赏，完成悬赏任务押金退回，失败则押金不退，是否领取',
		['SystemChannel'] = 0
		},
	[190500135] = {
		['ID'] = 190500135,
		['Type'] = 1,
		['Text'] = '无法领取自己发布的悬赏任务',
		['SystemChannel'] = 0
		},
	[190500136] = {
		['ID'] = 190500136,
		['Type'] = 1,
		['Text'] = '无法领取多个悬赏任务',
		['SystemChannel'] = 0
		},
	[190500137] = {
		['ID'] = 190500137,
		['Type'] = 1,
		['Text'] = '悬赏任务已经被其他人领取',
		['SystemChannel'] = 0
		},
	[190500138] = {
		['ID'] = 190500138,
		['Type'] = 4,
		['Text'] = '悬赏任务已超时取消',
		['SystemChannel'] = 0
		},
	[190500139] = {
		['ID'] = 190500139,
		['Type'] = 1,
		['Text'] = '押金不足，无法领取悬赏',
		['SystemChannel'] = 0
		},
	[190500140] = {
		['ID'] = 190500140,
		['Type'] = 4,
		['Text'] = '今日江湖悬赏任务已达上限，请明日再来',
		['SystemChannel'] = 0
		},
	[190500141] = {
		['ID'] = 190500141,
		['Type'] = 4,
		['Text'] = '您的悬赏目标上线了，可以点击任务追踪开始悬赏！',
		['SystemChannel'] = 0
		},
	[190500142] = {
		['ID'] = 190500142,
		['Type'] = 4,
		['Text'] = '悬赏目标与您在同一个地图',
		['SystemChannel'] = 0
		},
	[190500143] = {
		['ID'] = 190500143,
		['Type'] = 4,
		['Text'] = '悬赏目标所在场景无法传送',
		['SystemChannel'] = 0
		},
	[190500144] = {
		['ID'] = 190500144,
		['Type'] = 4,
		['Text'] = '悬赏目标下线跑路了，暂时无法追踪',
		['SystemChannel'] = 0
		},
	[190500145] = {
		['ID'] = 190500145,
		['Type'] = 4,
		['Text'] = '悬赏任务失败了，请重新接取',
		['SystemChannel'] = 0
		},
	[190500146] = {
		['ID'] = 190500146,
		['Type'] = 1,
		['Text'] = '当前没有悬赏目标，无法使用追杀令',
		['SystemChannel'] = 0
		},
	[190500147] = {
		['ID'] = 190500147,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]的悬赏与您不是同一级别，无法进行刷新',
		['SystemChannel'] = 0
		},
	[190500148] = {
		['ID'] = 190500148,
		['Type'] = 1,
		['Text'] = '您的账号在别处登陆，请小心保管账号！',
		['SystemChannel'] = 0
		},
	[190500149] = {
		['ID'] = 190500149,
		['Type'] = 4,
		['Text'] = '已切换到[50b7d7]阵营[-]模式',
		['SystemChannel'] = 0
		},
	[190500150] = {
		['ID'] = 190500150,
		['Type'] = 4,
		['Text'] = '已切换到[eb5032]杀戮[-]模式',
		['SystemChannel'] = 0
		},
	[190500151] = {
		['ID'] = 190500151,
		['Type'] = 4,
		['Text'] = '对方拒绝进行切磋',
		['SystemChannel'] = 0
		},
	[190500152] = {
		['ID'] = 190500152,
		['Type'] = 4,
		['Text'] = '您向[00ff00]%s[-]发起了切磋请求',
		['SystemChannel'] = 0
		},
	[190500153] = {
		['ID'] = 190500153,
		['Type'] = 1,
		['Text'] = '双方距离太远，无法进行切磋',
		['SystemChannel'] = 0
		},
	[190500154] = {
		['ID'] = 190500154,
		['Type'] = 4,
		['Text'] = '已成功使用追杀令，悬赏目标已经在地图上标识\n[eb5032]注意一旦悬赏目标进行了场景传送，则标记效果会消失[-]',
		['SystemChannel'] = 0
		},
	[190500155] = {
		['ID'] = 190500155,
		['Type'] = 1,
		['Text'] = '悬赏目标下线跑路了，暂时无法使用追杀令追踪目标',
		['SystemChannel'] = 0
		},
	[190500156] = {
		['ID'] = 190500156,
		['Type'] = 1,
		['Text'] = '当前悬赏目标正处于追杀令效果中，暂时无须使用追杀令',
		['SystemChannel'] = 0
		},
	[190500157] = {
		['ID'] = 190500157,
		['Type'] = 1,
		['Text'] = '单次输入已达最大数量',
		['SystemChannel'] = 0
		},
	[190500158] = {
		['ID'] = 190500158,
		['Type'] = 4,
		['Text'] = '对方关闭了切磋邀请功能，无法邀请切磋',
		['SystemChannel'] = 0
		},
	[190500159] = {
		['ID'] = 190500159,
		['Type'] = 4,
		['Text'] = '对方关闭了组队邀请功能，无法邀请组队',
		['SystemChannel'] = 0
		},
	[190500160] = {
		['ID'] = 190500160,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]未准备，已退出匹配队列',
		['SystemChannel'] = 0
		},
	[190500161] = {
		['ID'] = 190500161,
		['Type'] = 3,
		['Text'] = '[536C85]是否取消参加匹配，取消会进入取消CD',
		['SystemChannel'] = 0
		},
	[190500162] = {
		['ID'] = 190500162,
		['Type'] = 4,
		['Text'] = '刷新成功',
		['SystemChannel'] = 0
		},
	[190500163] = {
		['ID'] = 190500163,
		['Type'] = 4,
		['Text'] = '您已退出匹配队列',
		['SystemChannel'] = 0
		},
	[190500164] = {
		['ID'] = 190500164,
		['Type'] = 4,
		['Text'] = '道具使用成功，您的杀戮值降低了',
		['SystemChannel'] = 0
		},
	[190500165] = {
		['ID'] = 190500165,
		['Type'] = 3,
		['Text'] = '[536C85]放弃本次悬赏会损失1次悬赏次数，是否放弃',
		['SystemChannel'] = 0
		},
	[190500166] = {
		['ID'] = 190500166,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]国御经验',
		['SystemChannel'] = 0
		},
	[190500167] = {
		['ID'] = 190500167,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]惩戒经验',
		['SystemChannel'] = 0
		},
	[190500168] = {
		['ID'] = 190500168,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]赏金经验',
		['SystemChannel'] = 0
		},
	[190500169] = {
		['ID'] = 190500169,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]国御货币',
		['SystemChannel'] = 0
		},
	[190500170] = {
		['ID'] = 190500170,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]惩戒货币',
		['SystemChannel'] = 0
		},
	[190500171] = {
		['ID'] = 190500171,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]赏金货币',
		['SystemChannel'] = 0
		},
	[190500172] = {
		['ID'] = 190500172,
		['Type'] = 1,
		['Text'] = '副本中禁止使用传送道具',
		['SystemChannel'] = 0
		},
	[190500173] = {
		['ID'] = 190500173,
		['Type'] = 4,
		['Text'] = '当前活动无法踢出队员',
		['SystemChannel'] = 0
		},
	[190500174] = {
		['ID'] = 190500174,
		['Type'] = 4,
		['Text'] = '当前活动无法退出队伍',
		['SystemChannel'] = 0
		},
	[190500175] = {
		['ID'] = 190500175,
		['Type'] = 1,
		['Text'] = '当前正处于匹配中，无须再次参加',
		['SystemChannel'] = 0
		},
	[190500176] = {
		['ID'] = 190500176,
		['Type'] = 4,
		['Text'] = '您当前杀戮值为0，无须使用',
		['SystemChannel'] = 0
		},
	[190500177] = {
		['ID'] = 190500177,
		['Type'] = 4,
		['Text'] = '加入阵营成功',
		['SystemChannel'] = 0
		},
	[190500178] = {
		['ID'] = 190500178,
		['Type'] = 1,
		['Text'] = '活跃度不足，无法领取该奖励',
		['SystemChannel'] = 0
		},
	[190500179] = {
		['ID'] = 190500179,
		['Type'] = 4,
		['Text'] = '改变阵营成功',
		['SystemChannel'] = 0
		},
	[190500180] = {
		['ID'] = 190500180,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定返回登陆界面',
		['SystemChannel'] = 0
		},
	[190500181] = {
		['ID'] = 190500181,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定返回角色选择界面',
		['SystemChannel'] = 0
		},
	[190500182] = {
		['ID'] = 190500182,
		['Type'] = 4,
		['Text'] = '还有[eb5032]%s[-]秒才能再次使用脱离卡死功能',
		['SystemChannel'] = 0
		},
	[190500183] = {
		['ID'] = 190500183,
		['Type'] = 3,
		['Text'] = '[536C85]转换阵营需要消耗[f69e40]%s[-]元宝，确定是否转换？',
		['SystemChannel'] = 0
		},
	[190500184] = {
		['ID'] = 190500184,
		['Type'] = 4,
		['Text'] = '您的杀戮值超过[eb5032]%s[-]点，暂时无法切换PK模式',
		['SystemChannel'] = 0
		},
	[190500185] = {
		['ID'] = 190500185,
		['Type'] = 4,
		['Text'] = '当前场景无法切换PK模式',
		['SystemChannel'] = 0
		},
	[190500186] = {
		['ID'] = 190500186,
		['Type'] = 4,
		['Text'] = '您的杀戮值提高了[eb5032]%s[-]点',
		['SystemChannel'] = 0
		},
	[190500187] = {
		['ID'] = 190500187,
		['Type'] = 4,
		['Text'] = '您的杀戮值降低了[40f765]%s[-]点',
		['SystemChannel'] = 0
		},
	[190500188] = {
		['ID'] = 190500188,
		['Type'] = 4,
		['Text'] = '您的杀戮值超过[eb5032]%s[-]点，已被自动切为杀戮模式',
		['SystemChannel'] = 0
		},
	[190500189] = {
		['ID'] = 190500189,
		['Type'] = 4,
		['Text'] = '当前阵营人数过多，请加入其它阵营',
		['SystemChannel'] = 0
		},
	[190500190] = {
		['ID'] = 190500190,
		['Type'] = 3,
		['Text'] = '[536C85]即将前往危险区域，可能与其他玩家发生战斗，确定进入吗？',
		['SystemChannel'] = 0
		},
	[190500191] = {
		['ID'] = 190500191,
		['Type'] = 4,
		['Text'] = '成功删除聊天记录',
		['SystemChannel'] = 0
		},
	[190500192] = {
		['ID'] = 190500192,
		['Type'] = 6,
		['Text'] = '您距离上次离开累计离线[40f765]%s[-]分钟，共获得[40f765]%d[-]点离线经验',
		['SystemChannel'] = 0
		},
	[190500193] = {
		['ID'] = 190500193,
		['Type'] = 6,
		['Text'] = '您的好友[00ff00]%s[-]已成功改名为[00ff00]%s[-]，快去和Ta聊聊吧',
		['SystemChannel'] = 0
		},
	[190500194] = {
		['ID'] = 190500194,
		['Type'] = 6,
		['Text'] = '[00ff00]%s[-]已经把你添加为好友了，是否要也把Ta添加好友',
		['SystemChannel'] = 0
		},
	[190500195] = {
		['ID'] = 190500195,
		['Type'] = 6,
		['Text'] = '[00ff00]%s[-]向您赠送了[40f765]%s[-]个%s，是否回赠礼物',
		['SystemChannel'] = 0
		},
	[190500196] = {
		['ID'] = 190500196,
		['Type'] = 3,
		['Text'] = '[536C85]是否添加[00ff00]%s[-]为好友',
		['SystemChannel'] = 0
		},
	[190500197] = {
		['ID'] = 190500197,
		['Type'] = 4,
		['Text'] = '成功添加[00ff00]%s[-]为好友',
		['SystemChannel'] = 0
		},
	[190500198] = {
		['ID'] = 190500198,
		['Type'] = 4,
		['Text'] = '双方不为好友，无法互赠礼物',
		['SystemChannel'] = 0
		},
	[190500199] = {
		['ID'] = 190500199,
		['Type'] = 4,
		['Text'] = '今日赠送给[00ff00]%s[-]的名额已满',
		['SystemChannel'] = 0
		},
	[190500200] = {
		['ID'] = 190500200,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]今日无法再接受礼物了',
		['SystemChannel'] = 0
		},
	[190500201] = {
		['ID'] = 190500201,
		['Type'] = 4,
		['Text'] = '赠送礼物数量将超过上限，请减少数量后再赠送',
		['SystemChannel'] = 0
		},
	[190500202] = {
		['ID'] = 190500202,
		['Type'] = 4,
		['Text'] = '删除分组成功',
		['SystemChannel'] = 0
		},
	[190500203] = {
		['ID'] = 190500203,
		['Type'] = 4,
		['Text'] = '礼物已送出~',
		['SystemChannel'] = 0
		},
	[190500204] = {
		['ID'] = 190500204,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定删除[00ff00]%s[-]好友，删除后好感度会清零',
		['SystemChannel'] = 0
		},
	[190500205] = {
		['ID'] = 190500205,
		['Type'] = 1,
		['Text'] = '当前尚未建立分组，无法更改',
		['SystemChannel'] = 0
		},
	[190500206] = {
		['ID'] = 190500206,
		['Type'] = 4,
		['Text'] = '更改分组成功',
		['SystemChannel'] = 0
		},
	[190500207] = {
		['ID'] = 190500207,
		['Type'] = 3,
		['Text'] = '[536C85]您的好友已达上限，可通过使用道具“广交益友”来扩充至[2c9124]%s[-]上限',
		['SystemChannel'] = 0
		},
	[190500208] = {
		['ID'] = 190500208,
		['Type'] = 4,
		['Text'] = '您的好友上限已扩充至[40f765]%s[-]',
		['SystemChannel'] = 0
		},
	[190500209] = {
		['ID'] = 190500209,
		['Type'] = 1,
		['Text'] = '您的好友已达上限，请删除部分好友再进行添加',
		['SystemChannel'] = 0
		},
	[190500210] = {
		['ID'] = 190500210,
		['Type'] = 3,
		['Text'] = '[536C85]确定要将该玩家加入黑名单？',
		['SystemChannel'] = 0
		},
	[190500211] = {
		['ID'] = 190500211,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]已被加入黑名单，他的所有发言将会被屏蔽处理',
		['SystemChannel'] = 0
		},
	[190500212] = {
		['ID'] = 190500212,
		['Type'] = 4,
		['Text'] = '您已将[00ff00]%s[-]删除黑名单，一删泯恩仇',
		['SystemChannel'] = 0
		},
	[190500213] = {
		['ID'] = 190500213,
		['Type'] = 4,
		['Text'] = '黑名单已达上限，系统已自动删除最早加入黑名单玩家',
		['SystemChannel'] = 0
		},
	[190500214] = {
		['ID'] = 190500214,
		['Type'] = 1,
		['Text'] = '名字含有违禁词组',
		['SystemChannel'] = 0
		},
	[190500215] = {
		['ID'] = 190500215,
		['Type'] = 1,
		['Text'] = '已有同名字的分组',
		['SystemChannel'] = 0
		},
	[190500216] = {
		['ID'] = 190500216,
		['Type'] = 1,
		['Text'] = '组名不能为空',
		['SystemChannel'] = 0
		},
	[190500217] = {
		['ID'] = 190500217,
		['Type'] = 1,
		['Text'] = '好友分组数量已达上限，无法再创建新的分组',
		['SystemChannel'] = 0
		},
	[190500218] = {
		['ID'] = 190500218,
		['Type'] = 6,
		['Text'] = '仇人名单已达上限，系统已自动删除最早加入仇人名单玩家',
		['SystemChannel'] = 0
		},
	[190500219] = {
		['ID'] = 190500219,
		['Type'] = 1,
		['Text'] = '找不到匹配的玩家',
		['SystemChannel'] = 0
		},
	[190500220] = {
		['ID'] = 190500220,
		['Type'] = 1,
		['Text'] = '查找目标必须为其他玩家',
		['SystemChannel'] = 0
		},
	[190500221] = {
		['ID'] = 190500221,
		['Type'] = 4,
		['Text'] = '已成功添加所有好友请求玩家',
		['SystemChannel'] = 0
		},
	[190500222] = {
		['ID'] = 190500222,
		['Type'] = 4,
		['Text'] = '您的好友已达上限，成功添加部分好友请求玩家',
		['SystemChannel'] = 0
		},
	[190500223] = {
		['ID'] = 190500223,
		['Type'] = 4,
		['Text'] = '已拒绝所有好友请求',
		['SystemChannel'] = 0
		},
	[190500224] = {
		['ID'] = 190500224,
		['Type'] = 6,
		['Text'] = '您的好友请求数量已达上限，系统已自动删除最早的好友请求玩家',
		['SystemChannel'] = 0
		},
	[190500225] = {
		['ID'] = 190500225,
		['Type'] = 3,
		['Text'] = '[536C85]答题活动已开启，是否进入答题界面进行答题？',
		['SystemChannel'] = 0
		},
	[190500226] = {
		['ID'] = 190500226,
		['Type'] = 4,
		['Text'] = '转换阵营还需要%s',
		['SystemChannel'] = 0
		},
	[190500227] = {
		['ID'] = 190500227,
		['Type'] = 1,
		['Text'] = '您输入的门宗名称过短',
		['SystemChannel'] = 0
		},
	[190500228] = {
		['ID'] = 190500228,
		['Type'] = 1,
		['Text'] = '您输入的门宗名称过长',
		['SystemChannel'] = 0
		},
	[190500229] = {
		['ID'] = 190500229,
		['Type'] = 1,
		['Text'] = '您输入的门宗名称带非法字符',
		['SystemChannel'] = 0
		},
	[190500230] = {
		['ID'] = 190500230,
		['Type'] = 1,
		['Text'] = '您输入的门宗名称已存在',
		['SystemChannel'] = 0
		},
	[190500231] = {
		['ID'] = 190500231,
		['Type'] = 1,
		['Text'] = '创建或加入门宗需要达到[eb5032]%s[-]级',
		['SystemChannel'] = 0
		},
	[190500232] = {
		['ID'] = 190500232,
		['Type'] = 1,
		['Text'] = '您的元宝不足，无法创建门宗',
		['SystemChannel'] = 0
		},
	[190500233] = {
		['ID'] = 190500233,
		['Type'] = 4,
		['Text'] = '今日民间悬赏任务已达上限，请明日再来',
		['SystemChannel'] = 0
		},
	[190500234] = {
		['ID'] = 190500234,
		['Type'] = 1,
		['Text'] = '您的帮贡或银两不足，无法修炼',
		['SystemChannel'] = 0
		},
	[190500235] = {
		['ID'] = 190500235,
		['Type'] = 1,
		['Text'] = '请先研发该技能',
		['SystemChannel'] = 0
		},
	[190500236] = {
		['ID'] = 190500236,
		['Type'] = 1,
		['Text'] = '您的门宗资金不足，无法研发',
		['SystemChannel'] = 0
		},
	[190500237] = {
		['ID'] = 190500237,
		['Type'] = 1,
		['Text'] = '请先提升藏经阁等级',
		['SystemChannel'] = 0
		},
	[190500238] = {
		['ID'] = 190500238,
		['Type'] = 1,
		['Text'] = '您的门宗资金或建筑令不足，无法升级',
		['SystemChannel'] = 0
		},
	[190500239] = {
		['ID'] = 190500239,
		['Type'] = 1,
		['Text'] = '请先提升门宗大厅等级',
		['SystemChannel'] = 0
		},
	[190500240] = {
		['ID'] = 190500240,
		['Type'] = 1,
		['Text'] = '门宗ID不存在',
		['SystemChannel'] = 0
		},
	[190500241] = {
		['ID'] = 190500241,
		['Type'] = 1,
		['Text'] = '门宗名称不存在',
		['SystemChannel'] = 0
		},
	[190500242] = {
		['ID'] = 190500242,
		['Type'] = 1,
		['Text'] = '修改成功',
		['SystemChannel'] = 0
		},
	[190500243] = {
		['ID'] = 190500243,
		['Type'] = 1,
		['Text'] = '该门宗不再招募成员',
		['SystemChannel'] = 0
		},
	[190500244] = {
		['ID'] = 190500244,
		['Type'] = 1,
		['Text'] = '您的道具不足，无法修改门宗名称',
		['SystemChannel'] = 0
		},
	[190500245] = {
		['ID'] = 190500245,
		['Type'] = 1,
		['Text'] = '门宗改名[eb5032]%s[-]后方可再次改名',
		['SystemChannel'] = 0
		},
	[190500246] = {
		['ID'] = 190500246,
		['Type'] = 1,
		['Text'] = '官府悬赏任务完成',
		['SystemChannel'] = 0
		},
	[190500247] = {
		['ID'] = 190500247,
		['Type'] = 1,
		['Text'] = '对方已加入其他门宗',
		['SystemChannel'] = 0
		},
	[190500248] = {
		['ID'] = 190500248,
		['Type'] = 1,
		['Text'] = '门宗成员已满，无法邀请入宗',
		['SystemChannel'] = 0
		},
	[190500249] = {
		['ID'] = 190500249,
		['Type'] = 4,
		['Text'] = '您已加入[eb5032]%s[-]门宗',
		['SystemChannel'] = 0
		},
	[190500250] = {
		['ID'] = 190500250,
		['Type'] = 1,
		['Text'] = '其他建筑正在升级，请稍后再试',
		['SystemChannel'] = 0
		},
	[190500251] = {
		['ID'] = 190500251,
		['Type'] = 1,
		['Text'] = '您已被请离门宗',
		['SystemChannel'] = 1
		},
	[190500252] = {
		['ID'] = 190500252,
		['Type'] = 1,
		['Text'] = '悬赏金额为0，无法发布悬赏',
		['SystemChannel'] = 0
		},
	[190500253] = {
		['ID'] = 190500253,
		['Type'] = 1,
		['Text'] = '该玩家的申请已失效',
		['SystemChannel'] = 0
		},
	[190500254] = {
		['ID'] = 190500254,
		['Type'] = 3,
		['Text'] = '[536C85]收益次数为0，只可获得少量奖励，是否确认进入',
		['SystemChannel'] = 0
		},
	[190500255] = {
		['ID'] = 190500255,
		['Type'] = 1,
		['Text'] = '退出门宗后需[eb5032]%s[-]后才能再次创建或加入',
		['SystemChannel'] = 0
		},
	[190500256] = {
		['ID'] = 190500256,
		['Type'] = 4,
		['Text'] = '等级不足，无法加入阵营',
		['SystemChannel'] = 0
		},
	[190500257] = {
		['ID'] = 190500257,
		['Type'] = 4,
		['Text'] = '等级不足，无法转换阵营',
		['SystemChannel'] = 0
		},
	[190500258] = {
		['ID'] = 190500258,
		['Type'] = 4,
		['Text'] = '对不起，当前未加入阵营',
		['SystemChannel'] = 0
		},
	[190500259] = {
		['ID'] = 190500259,
		['Type'] = 4,
		['Text'] = '前往场景人数已满',
		['SystemChannel'] = 0
		},
	[190500260] = {
		['ID'] = 190500260,
		['Type'] = 4,
		['Text'] = '对不起，你已经接取过该任务',
		['SystemChannel'] = 0
		},
	[190500261] = {
		['ID'] = 190500261,
		['Type'] = 3,
		['Text'] = '[536C85]即将前往危险区域，可能与其他玩家发生战斗，确认进入吗？',
		['SystemChannel'] = 0
		},
	[190500262] = {
		['ID'] = 190500262,
		['Type'] = 3,
		['Text'] = '[536C85]战场危险，是否前去组队？',
		['SystemChannel'] = 0
		},
	[190500263] = {
		['ID'] = 190500263,
		['Type'] = 4,
		['Text'] = '对不起,队伍中有其他阵营玩家',
		['SystemChannel'] = 0
		},
	[190500264] = {
		['ID'] = 190500264,
		['Type'] = 4,
		['Text'] = '对不起，当日开启物资已达上限',
		['SystemChannel'] = 0
		},
	[190500265] = {
		['ID'] = 190500265,
		['Type'] = 4,
		['Text'] = '对不起，当前所有线全满',
		['SystemChannel'] = 0
		},
	[190500266] = {
		['ID'] = 190500266,
		['Type'] = 4,
		['Text'] = '已成功换线',
		['SystemChannel'] = 0
		},
	[190500267] = {
		['ID'] = 190500267,
		['Type'] = 4,
		['Text'] = '门宗名称不能包含数字',
		['SystemChannel'] = 0
		},
	[190500268] = {
		['ID'] = 190500268,
		['Type'] = 4,
		['Text'] = '门宗商店等级不足，购买失败',
		['SystemChannel'] = 0
		},
	[190500269] = {
		['ID'] = 190500269,
		['Type'] = 4,
		['Text'] = '当前没有加入门宗，请前去加入门宗',
		['SystemChannel'] = 0
		},
	[190500270] = {
		['ID'] = 190500270,
		['Type'] = 4,
		['Text'] = '申请成功',
		['SystemChannel'] = 0
		},
	[190500271] = {
		['ID'] = 190500271,
		['Type'] = 4,
		['Text'] = '当前血瓶数量不足',
		['SystemChannel'] = 0
		},
	[190500272] = {
		['ID'] = 190500272,
		['Type'] = 4,
		['Text'] = '当前为满血状态，无需使用药瓶',
		['SystemChannel'] = 0
		},
	[190500273] = {
		['ID'] = 190500273,
		['Type'] = 4,
		['Text'] = '当前道具无法使用，请在[eb5032]%s[-]秒后再试',
		['SystemChannel'] = 0
		},
	[190500274] = {
		['ID'] = 190500274,
		['Type'] = 4,
		['Text'] = '您已经在门宗领地里了！',
		['SystemChannel'] = 0
		},
	[190500275] = {
		['ID'] = 190500275,
		['Type'] = 4,
		['Text'] = '您已退出门宗',
		['SystemChannel'] = 0
		},
	[190500276] = {
		['ID'] = 190500276,
		['Type'] = 4,
		['Text'] = '当前场景无法使用药剂',
		['SystemChannel'] = 0
		},
	[190500277] = {
		['ID'] = 190500277,
		['Type'] = 4,
		['Text'] = '血池已达上限，无法再进行补充',
		['SystemChannel'] = 0
		},
	[190500278] = {
		['ID'] = 190500278,
		['Type'] = 3,
		['Text'] = '[536C85]门宗答题活动已开始，是否进行活动？',
		['SystemChannel'] = 0
		},
	[190500279] = {
		['ID'] = 190500279,
		['Type'] = 4,
		['Text'] = '新建分组成功',
		['SystemChannel'] = 0
		},
	[190500280] = {
		['ID'] = 190500280,
		['Type'] = 4,
		['Text'] = '您与[00ff00]%s[-]断绝了好友关系',
		['SystemChannel'] = 0
		},
	[190500281] = {
		['ID'] = 190500281,
		['Type'] = 4,
		['Text'] = '当前选择的礼物数量不足',
		['SystemChannel'] = 0
		},
	[190500282] = {
		['ID'] = 190500282,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]不再是您的仇人',
		['SystemChannel'] = 0
		},
	[190500283] = {
		['ID'] = 190500283,
		['Type'] = 1,
		['Text'] = '没有可使用的藏宝图',
		['SystemChannel'] = 0
		},
	[190500284] = {
		['ID'] = 190500284,
		['Type'] = 1,
		['Text'] = '背包空位不足，请先整理背包再开始寻宝',
		['SystemChannel'] = 0
		},
	[190500285] = {
		['ID'] = 190500285,
		['Type'] = 4,
		['Text'] = '远古神魔带着重宝回到了黑暗中',
		['SystemChannel'] = 0
		},
	[190500286] = {
		['ID'] = 190500286,
		['Type'] = 4,
		['Text'] = '真是太好运了，您挖到了%s，快打开来看一下吧！',
		['SystemChannel'] = 0
		},
	[190500287] = {
		['ID'] = 190500287,
		['Type'] = 4,
		['Text'] = '天啊，您惊动了宝藏守卫，快干掉他们！',
		['SystemChannel'] = 0
		},
	[190500288] = {
		['ID'] = 190500288,
		['Type'] = 4,
		['Text'] = '你不小心挖破了封印，远古魔神携重宝降临，快干掉他！',
		['SystemChannel'] = 0
		},
	[190500289] = {
		['ID'] = 190500289,
		['Type'] = 4,
		['Text'] = '今日商会押镖次数已用完，请明天再继续',
		['SystemChannel'] = 0
		},
	[190500290] = {
		['ID'] = 190500290,
		['Type'] = 4,
		['Text'] = '上古秘境已经被打开，快去破除封印',
		['SystemChannel'] = 0
		},
	[190500291] = {
		['ID'] = 190500291,
		['Type'] = 4,
		['Text'] = '今日阵营押镖次数已用完，请明天再继续',
		['SystemChannel'] = 0
		},
	[190500292] = {
		['ID'] = 190500292,
		['Type'] = 4,
		['Text'] = '您身上还有押镖任务，请完成后再来参与',
		['SystemChannel'] = 0
		},
	[190500293] = {
		['ID'] = 190500293,
		['Type'] = 3,
		['Text'] = '[536C85]参与商会押镖需要缴纳[65cd59]%d[-]押金，押镖成功全额返还，是否确认继续',
		['SystemChannel'] = 0
		},
	[190500294] = {
		['ID'] = 190500294,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]银两不足，无法参加活动',
		['SystemChannel'] = 0
		},
	[190500295] = {
		['ID'] = 190500295,
		['Type'] = 1,
		['Text'] = '押镖任务超时任务失败，请重新接取押镖',
		['SystemChannel'] = 0
		},
	[190500296] = {
		['ID'] = 190500296,
		['Type'] = 3,
		['Text'] = '[536C85]放弃押镖任务会损失押金以及参与次数，是否确认放弃',
		['SystemChannel'] = 0
		},
	[190500297] = {
		['ID'] = 190500297,
		['Type'] = 4,
		['Text'] = '押镖任务已放弃',
		['SystemChannel'] = 0
		},
	[190500298] = {
		['ID'] = 190500298,
		['Type'] = 1,
		['Text'] = '镖车已损坏任务失败，请重新接取押镖',
		['SystemChannel'] = 0
		},
	[190500299] = {
		['ID'] = 190500299,
		['Type'] = 4,
		['Text'] = '镖车受到攻击，请立即保护',
		['SystemChannel'] = 0
		},
	[190500300] = {
		['ID'] = 190500300,
		['Type'] = 4,
		['Text'] = '战斗中无法乘坐镖车',
		['SystemChannel'] = 0
		},
	[190500301] = {
		['ID'] = 190500301,
		['Type'] = 1,
		['Text'] = '当前状态无法使用坐骑功能',
		['SystemChannel'] = 0
		},
	[190500302] = {
		['ID'] = 190500302,
		['Type'] = 4,
		['Text'] = '遭遇劫匪，无法乘坐镖车！',
		['SystemChannel'] = 0
		},
	[190500303] = {
		['ID'] = 190500303,
		['Type'] = 4,
		['Text'] = '正在押镖，无法使用藏宝图',
		['SystemChannel'] = 0
		},
	[190500304] = {
		['ID'] = 190500304,
		['Type'] = 4,
		['Text'] = '马儿耐力值为0，获得筋疲力尽效果',
		['SystemChannel'] = 0
		},
	[190500305] = {
		['ID'] = 190500305,
		['Type'] = 1,
		['Text'] = '正在押镖，无法进行传送',
		['SystemChannel'] = 0
		},
	[190500306] = {
		['ID'] = 190500306,
		['Type'] = 1,
		['Text'] = '您没有加入阵营，无法参与阵营押镖',
		['SystemChannel'] = 0
		},
	[190500307] = {
		['ID'] = 190500307,
		['Type'] = 3,
		['Text'] = '[536C85]需要缴纳[65cd59]%d[-]押金参与阵营押镖，阵营押镖可能会被敌对阵营玩家攻击，是否确认继续',
		['SystemChannel'] = 0
		},
	[190500308] = {
		['ID'] = 190500308,
		['Type'] = 3,
		['Text'] = '[536C85]您当前还有押镖次数，是否继续押镖',
		['SystemChannel'] = 0
		},
	[190500309] = {
		['ID'] = 190500309,
		['Type'] = 3,
		['Text'] = '[536C85]您当前还有押镖次数，是否继续押镖',
		['SystemChannel'] = 0
		},
	[190500310] = {
		['ID'] = 190500310,
		['Type'] = 1,
		['Text'] = '您处于阵营押镖中，暂时无法进行阵营变更',
		['SystemChannel'] = 0
		},
	[190500311] = {
		['ID'] = 190500311,
		['Type'] = 1,
		['Text'] = '押镖过程中无法修改PK模式',
		['SystemChannel'] = 0
		},
	[190500312] = {
		['ID'] = 190500312,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]进入游戏',
		['SystemChannel'] = 0
		},
	[190500313] = {
		['ID'] = 190500313,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]退出游戏',
		['SystemChannel'] = 0
		},
	[190500314] = {
		['ID'] = 190500314,
		['Type'] = 1,
		['Text'] = '操作频繁，请[eb5032]%s[-]秒后再试',
		['SystemChannel'] = 0
		},
	[190500315] = {
		['ID'] = 190500315,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法领取',
		['SystemChannel'] = 0
		},
	[190500316] = {
		['ID'] = 190500316,
		['Type'] = 1,
		['Text'] = '您身上还有押镖任务，请完成后再来参与',
		['SystemChannel'] = 0
		},
	[190500317] = {
		['ID'] = 190500317,
		['Type'] = 1,
		['Text'] = '道具不足，无法解锁',
		['SystemChannel'] = 0
		},
	[190500318] = {
		['ID'] = 190500318,
		['Type'] = 3,
		['Text'] = '[536C85]元宝不足，是否进行充值？',
		['SystemChannel'] = 0
		},
	[190500319] = {
		['ID'] = 190500319,
		['Type'] = 4,
		['Text'] = '选择专精成功！',
		['SystemChannel'] = 0
		},
	[190500320] = {
		['ID'] = 190500320,
		['Type'] = 4,
		['Text'] = '攻击范围内无目标，无法施放怒气技',
		['SystemChannel'] = 0
		},
	[190500321] = {
		['ID'] = 190500321,
		['Type'] = 4,
		['Text'] = '购买成功',
		['SystemChannel'] = 0
		},
	[190500322] = {
		['ID'] = 190500322,
		['Type'] = 1,
		['Text'] = '[00ff00]%s[-]未准备，无法开启副本',
		['SystemChannel'] = 0
		},
	[190500323] = {
		['ID'] = 190500323,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]邀请你参加%s，成功援助可获得侠义值奖励！',
		['SystemChannel'] = 0
		},
	[190500324] = {
		['ID'] = 190500324,
		['Type'] = 4,
		['Text'] = '活跃度达到[eb5032]%s[-]方可领取宝箱',
		['SystemChannel'] = 0
		},
	[190500325] = {
		['ID'] = 190500325,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法获得任务道具',
		['SystemChannel'] = 0
		},
	[190500326] = {
		['ID'] = 190500326,
		['Type'] = 4,
		['Text'] = '您的血池增加了[00ff00]%s[-]点，在脱战后会自动恢复血量',
		['SystemChannel'] = 0
		},
	[190500327] = {
		['ID'] = 190500327,
		['Type'] = 4,
		['Text'] = '对不起，没有符合当前替换的技能书',
		['SystemChannel'] = 0
		},
	[190500328] = {
		['ID'] = 190500328,
		['Type'] = 4,
		['Text'] = '对不起，没有符合当前学习的技能书',
		['SystemChannel'] = 0
		},
	[190500329] = {
		['ID'] = 190500329,
		['Type'] = 4,
		['Text'] = '%s技能升级成功',
		['SystemChannel'] = 0
		},
	[190500330] = {
		['ID'] = 190500330,
		['Type'] = 4,
		['Text'] = '技能替换成功',
		['SystemChannel'] = 0
		},
	[190500331] = {
		['ID'] = 190500331,
		['Type'] = 4,
		['Text'] = '使用%s成功',
		['SystemChannel'] = 0
		},
	[190500332] = {
		['ID'] = 190500332,
		['Type'] = 4,
		['Text'] = '当前伙伴上阵已满',
		['SystemChannel'] = 0
		},
	[190500333] = {
		['ID'] = 190500333,
		['Type'] = 4,
		['Text'] = '每人最多只能同时发布[eb5032]%s[-]条悬赏',
		['SystemChannel'] = 0
		},
	[190500334] = {
		['ID'] = 190500334,
		['Type'] = 4,
		['Text'] = '伙伴等级不能超过角色等级',
		['SystemChannel'] = 0
		},
	[190500335] = {
		['ID'] = 190500335,
		['Type'] = 4,
		['Text'] = '角色等级不足，无法佩戴',
		['SystemChannel'] = 0
		},
	[190500336] = {
		['ID'] = 190500336,
		['Type'] = 4,
		['Text'] = '对不起，伙伴背包已满',
		['SystemChannel'] = 0
		},
	[190500337] = {
		['ID'] = 190500337,
		['Type'] = 4,
		['Text'] = '当前背包已满',
		['SystemChannel'] = 0
		},
	[190500338] = {
		['ID'] = 190500338,
		['Type'] = 4,
		['Text'] = '需要[eb5032]%s[-]级才能开启',
		['SystemChannel'] = 0
		},
	[190500339] = {
		['ID'] = 190500339,
		['Type'] = 4,
		['Text'] = '领取悬赏任务成功',
		['SystemChannel'] = 0
		},
	[190500340] = {
		['ID'] = 190500340,
		['Type'] = 1,
		['Text'] = '无法领取悬赏目标为自身的任务',
		['SystemChannel'] = 0
		},
	[190500341] = {
		['ID'] = 190500341,
		['Type'] = 4,
		['Text'] = '您发布对%s玩家的悬赏令已过期，退回悬赏金额可在邮件中领取',
		['SystemChannel'] = 0
		},
	[190500342] = {
		['ID'] = 190500342,
		['Type'] = 4,
		['Text'] = '队长已领取官府悬赏任务',
		['SystemChannel'] = 0
		},
	[190500343] = {
		['ID'] = 190500343,
		['Type'] = 4,
		['Text'] = '队长已刷新官府悬赏任务',
		['SystemChannel'] = 0
		},
	[190500344] = {
		['ID'] = 190500344,
		['Type'] = 4,
		['Text'] = '请先离开门宗再进行阵营操作',
		['SystemChannel'] = 0
		},
	[190500345] = {
		['ID'] = 190500345,
		['Type'] = 4,
		['Text'] = '您未加入阵营，无法创建门宗',
		['SystemChannel'] = 0
		},
	[190500346] = {
		['ID'] = 190500346,
		['Type'] = 4,
		['Text'] = '您与门宗宗主阵营不同，无法申请加入',
		['SystemChannel'] = 0
		},
	[190500347] = {
		['ID'] = 190500347,
		['Type'] = 4,
		['Text'] = '需要先加入阵营后，才能加入门宗',
		['SystemChannel'] = 0
		},
	[190500348] = {
		['ID'] = 190500348,
		['Type'] = 4,
		['Text'] = '更换成功',
		['SystemChannel'] = 0
		},
	[190500349] = {
		['ID'] = 190500349,
		['Type'] = 4,
		['Text'] = '炼星失败',
		['SystemChannel'] = 0
		},
	[190500350] = {
		['ID'] = 190500350,
		['Type'] = 4,
		['Text'] = '炼星成功',
		['SystemChannel'] = 0
		},
	[190500351] = {
		['ID'] = 190500351,
		['Type'] = 4,
		['Text'] = '重铸成功',
		['SystemChannel'] = 0
		},
	[190500352] = {
		['ID'] = 190500352,
		['Type'] = 4,
		['Text'] = '洗练成功',
		['SystemChannel'] = 0
		},
	[190500353] = {
		['ID'] = 190500353,
		['Type'] = 4,
		['Text'] = '马儿太累了，需要%s秒后才能加速',
		['SystemChannel'] = 0
		},
	[190500354] = {
		['ID'] = 190500354,
		['Type'] = 4,
		['Text'] = '您的发言时间不足1秒',
		['SystemChannel'] = 0
		},
	[190500355] = {
		['ID'] = 190500355,
		['Type'] = 4,
		['Text'] = '已取消该条发言',
		['SystemChannel'] = 0
		},
	[190500356] = {
		['ID'] = 190500356,
		['Type'] = 4,
		['Text'] = '当前语音为空，请重新发言',
		['SystemChannel'] = 0
		},
	[190500357] = {
		['ID'] = 190500357,
		['Type'] = 4,
		['Text'] = '对不起，当前没有符合佩戴条件的法宝',
		['SystemChannel'] = 0
		},
	[190500358] = {
		['ID'] = 190500358,
		['Type'] = 4,
		['Text'] = '佩戴法宝成功',
		['SystemChannel'] = 0
		},
	[190500359] = {
		['ID'] = 190500359,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]拒绝参与活动',
		['SystemChannel'] = 0
		},
	[190500360] = {
		['ID'] = 190500360,
		['Type'] = 3,
		['Text'] = '[536C85]队长开启国御副本任务，是否接取',
		['SystemChannel'] = 0
		},
	[190500361] = {
		['ID'] = 190500361,
		['Type'] = 1,
		['Text'] = '%s正忙，无法进行传送',
		['SystemChannel'] = 0
		},
	[190500362] = {
		['ID'] = 190500362,
		['Type'] = 4,
		['Text'] = '在位面中无法使用藏宝图',
		['SystemChannel'] = 0
		},
	[190500363] = {
		['ID'] = 190500363,
		['Type'] = 4,
		['Text'] = '技能符文已更换',
		['SystemChannel'] = 0
		},
	[190500364] = {
		['ID'] = 190500364,
		['Type'] = 4,
		['Text'] = '技能符文已激活',
		['SystemChannel'] = 0
		},
	[190500365] = {
		['ID'] = 190500365,
		['Type'] = 4,
		['Text'] = '技能符文已卸下',
		['SystemChannel'] = 0
		},
	[190500366] = {
		['ID'] = 190500366,
		['Type'] = 4,
		['Text'] = '技能还在冷却中',
		['SystemChannel'] = 0
		},
	[190500367] = {
		['ID'] = 190500367,
		['Type'] = 4,
		['Text'] = '当前属性修灵已满，请提升其他属性',
		['SystemChannel'] = 0
		},
	[190500368] = {
		['ID'] = 190500368,
		['Type'] = 4,
		['Text'] = '当前坐骑已失效',
		['SystemChannel'] = 0
		},
	[190500369] = {
		['ID'] = 190500369,
		['Type'] = 1,
		['Text'] = '您还没有队伍',
		['SystemChannel'] = 0
		},
	[190500370] = {
		['ID'] = 190500370,
		['Type'] = 1,
		['Text'] = '您还没有门宗，请加入门宗后再尝试',
		['SystemChannel'] = 0
		},
	[190500371] = {
		['ID'] = 190500371,
		['Type'] = 1,
		['Text'] = '语音时间太短',
		['SystemChannel'] = 0
		},
	[190500372] = {
		['ID'] = 190500372,
		['Type'] = 1,
		['Text'] = '无法识别语音',
		['SystemChannel'] = 0
		},
	[190500373] = {
		['ID'] = 190500373,
		['Type'] = 1,
		['Text'] = '未达到开放等级，请提升等级后再来尝试',
		['SystemChannel'] = 0
		},
	[190500374] = {
		['ID'] = 190500374,
		['Type'] = 1,
		['Text'] = '等级不足，无法使用道具',
		['SystemChannel'] = 0
		},
	[190500375] = {
		['ID'] = 190500375,
		['Type'] = 4,
		['Text'] = '队长所在场景无法传送进入',
		['SystemChannel'] = 0
		},
	[190500376] = {
		['ID'] = 190500376,
		['Type'] = 4,
		['Text'] = '当前法宝为%s的专属法宝',
		['SystemChannel'] = 0
		},
	[190500377] = {
		['ID'] = 190500377,
		['Type'] = 4,
		['Text'] = '当前伙伴等级不足',
		['SystemChannel'] = 0
		},
	[190500379] = {
		['ID'] = 190500379,
		['Type'] = 4,
		['Text'] = '%s修炼满级后解锁',
		['SystemChannel'] = 0
		},
	[190500380] = {
		['ID'] = 190500380,
		['Type'] = 4,
		['Text'] = '当前穴位未激活',
		['SystemChannel'] = 0
		},
	[190500381] = {
		['ID'] = 190500381,
		['Type'] = 4,
		['Text'] = '回答正确！获得了奖励！',
		['SystemChannel'] = 0
		},
	[190500382] = {
		['ID'] = 190500382,
		['Type'] = 4,
		['Text'] = '需装备升到%s阶%s星开启',
		['SystemChannel'] = 0
		},
	[190500383] = {
		['ID'] = 190500383,
		['Type'] = 4,
		['Text'] = '已切换技能配置',
		['SystemChannel'] = 0
		},
	[190500384] = {
		['ID'] = 190500384,
		['Type'] = 3,
		['Text'] = '[536C85]退出门宗后[eb5032]%s[-]后才能再次创建或加入门宗，您是否确定退出？',
		['SystemChannel'] = 0
		},
	[190500385] = {
		['ID'] = 190500385,
		['Type'] = 4,
		['Text'] = '对不起，您的道具不足',
		['SystemChannel'] = 0
		},
	[190500386] = {
		['ID'] = 190500386,
		['Type'] = 2,
		['Text'] = '[536C85]您的锁妖笼不足，是否前往商城购买？',
		['SystemChannel'] = 0
		},
	[190500387] = {
		['ID'] = 190500387,
		['Type'] = 4,
		['Text'] = '临时手动操作开启，%s秒无操作会自动跟随',
		['SystemChannel'] = 0
		},
	[190500388] = {
		['ID'] = 190500388,
		['Type'] = 4,
		['Text'] = '临时手动操作关闭，继续跟随队长',
		['SystemChannel'] = 0
		},
	[190500389] = {
		['ID'] = 190500389,
		['Type'] = 4,
		['Text'] = '跟随队长状态下无法进行此操作，请取消跟随队长后再试',
		['SystemChannel'] = 0
		},
	[190500390] = {
		['ID'] = 190500390,
		['Type'] = 4,
		['Text'] = '阵营战场暂未开放，开放时间12:00-24:00',
		['SystemChannel'] = 0
		},
	[190500391] = {
		['ID'] = 190500391,
		['Type'] = 4,
		['Text'] = '称号已使用',
		['SystemChannel'] = 0
		},
	[190500392] = {
		['ID'] = 190500392,
		['Type'] = 4,
		['Text'] = '称号已卸下',
		['SystemChannel'] = 0
		},
	[190500393] = {
		['ID'] = 190500393,
		['Type'] = 4,
		['Text'] = '已获得该称号，无法使用道具',
		['SystemChannel'] = 0
		},
	[190500394] = {
		['ID'] = 190500394,
		['Type'] = 1,
		['Text'] = '等级不足，无法在该频道发送一键喊话',
		['SystemChannel'] = 0
		},
	[190500395] = {
		['ID'] = 190500395,
		['Type'] = 4,
		['Text'] = '恭喜您获得%s称号',
		['SystemChannel'] = 0
		},
	[190500396] = {
		['ID'] = 190500396,
		['Type'] = 1,
		['Text'] = '奖励已领取，无法重复领取',
		['SystemChannel'] = 0
		},
	[190500397] = {
		['ID'] = 190500397,
		['Type'] = 4,
		['Text'] = '当前资质已满',
		['SystemChannel'] = 0
		},
	[190500398] = {
		['ID'] = 190500398,
		['Type'] = 4,
		['Text'] = '当前正在进行赏金任务中',
		['SystemChannel'] = 0
		},
	[190500399] = {
		['ID'] = 190500399,
		['Type'] = 4,
		['Text'] = '当前正在进行押镖任务',
		['SystemChannel'] = 0
		},
	[190500400] = {
		['ID'] = 190500400,
		['Type'] = 3,
		['Text'] = '[536C85]阵营战开启，是否加入匹配？',
		['SystemChannel'] = 0
		},
	[190500401] = {
		['ID'] = 190500401,
		['Type'] = 3,
		['Text'] = '[536C85]阵营战即将开启，点击确定进入阵营战',
		['SystemChannel'] = 0
		},
	[190500402] = {
		['ID'] = 190500402,
		['Type'] = 3,
		['Text'] = '[536C85]您当前有队伍，点击确定退出队伍进入阵营战，点击取消取消参加阵营战',
		['SystemChannel'] = 0
		},
	[190500403] = {
		['ID'] = 190500403,
		['Type'] = 4,
		['Text'] = '报名成功',
		['SystemChannel'] = 0
		},
	[190500404] = {
		['ID'] = 190500404,
		['Type'] = 4,
		['Text'] = '等级不足，无法进入战场',
		['SystemChannel'] = 0
		},
	[190500405] = {
		['ID'] = 190500405,
		['Type'] = 4,
		['Text'] = '您的道具不足，无法进行时装兑换',
		['SystemChannel'] = 0
		},
	[190500406] = {
		['ID'] = 190500406,
		['Type'] = 4,
		['Text'] = '很遗憾什么都没有获得',
		['SystemChannel'] = 0
		},
	[190500407] = {
		['ID'] = 190500407,
		['Type'] = 3,
		['Text'] = '[536C85]背包空位不足，是否前往整理背包',
		['SystemChannel'] = 0
		},
	[190500408] = {
		['ID'] = 190500408,
		['Type'] = 4,
		['Text'] = '等级不足，无法前往该场景',
		['SystemChannel'] = 0
		},
	[190500409] = {
		['ID'] = 190500409,
		['Type'] = 1,
		['Text'] = '今日可参与活动次数已用尽，请明天再来挑战',
		['SystemChannel'] = 0
		},
	[190500410] = {
		['ID'] = 190500410,
		['Type'] = 1,
		['Text'] = '当前目标今日次数已用尽，请挑战其他目标',
		['SystemChannel'] = 0
		},
	[190500411] = {
		['ID'] = 190500411,
		['Type'] = 1,
		['Text'] = '目标达到三星可使用扫荡',
		['SystemChannel'] = 0
		},
	[190500412] = {
		['ID'] = 190500412,
		['Type'] = 4,
		['Text'] = '当前没有加入阵营，请加入阵营',
		['SystemChannel'] = 0
		},
	[190500413] = {
		['ID'] = 190500413,
		['Type'] = 4,
		['Text'] = '购买挑战次数成功',
		['SystemChannel'] = 0
		},
	[190500414] = {
		['ID'] = 190500414,
		['Type'] = 3,
		['Text'] = '[536C85]等级超过10级，将无法获得积分和奖励，仍要前往么？',
		['SystemChannel'] = 0
		},
	[190500415] = {
		['ID'] = 190500415,
		['Type'] = 4,
		['Text'] = '当前未加入阵营，无法进入！',
		['SystemChannel'] = 0
		},
	[190500416] = {
		['ID'] = 190500416,
		['Type'] = 4,
		['Text'] = '好像钓到了什么，赶快收杆！',
		['SystemChannel'] = 0
		},
	[190500417] = {
		['ID'] = 190500417,
		['Type'] = 4,
		['Text'] = '真遗憾，鱼竟然跑了！',
		['SystemChannel'] = 0
		},
	[190500418] = {
		['ID'] = 190500418,
		['Type'] = 1,
		['Text'] = '目前没有鱼饵，暂时无法开始钓鱼',
		['SystemChannel'] = 0
		},
	[190500419] = {
		['ID'] = 190500419,
		['Type'] = 4,
		['Text'] = '修炼符不足，无法进行刷新',
		['SystemChannel'] = 0
		},
	[190500420] = {
		['ID'] = 190500420,
		['Type'] = 4,
		['Text'] = '钓鱼活动未开启，暂时无法开始钓鱼',
		['SystemChannel'] = 0
		},
	[190500421] = {
		['ID'] = 190500421,
		['Type'] = 4,
		['Text'] = '在镖车上无法进行采集',
		['SystemChannel'] = 0
		},
	[190500422] = {
		['ID'] = 190500422,
		['Type'] = 4,
		['Text'] = '你已进入钓鱼区域',
		['SystemChannel'] = 0
		},
	[190500423] = {
		['ID'] = 190500423,
		['Type'] = 4,
		['Text'] = '你已离开钓鱼区域',
		['SystemChannel'] = 0
		},
	[190500424] = {
		['ID'] = 190500424,
		['Type'] = 4,
		['Text'] = '当前活动中无法更换阵营',
		['SystemChannel'] = 0
		},
	[190500425] = {
		['ID'] = 190500425,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]门宗贡献',
		['SystemChannel'] = 1
		},
	[190500426] = {
		['ID'] = 190500426,
		['Type'] = 3,
		['Text'] = '[536C85]是否花费[f69e40]%s元宝[-]增加1个寄售栏',
		['SystemChannel'] = 0
		},
	[190500427] = {
		['ID'] = 190500427,
		['Type'] = 4,
		['Text'] = '购买成功',
		['SystemChannel'] = 0
		},
	[190500428] = {
		['ID'] = 190500428,
		['Type'] = 4,
		['Text'] = '上架成功',
		['SystemChannel'] = 0
		},
	[190500429] = {
		['ID'] = 190500429,
		['Type'] = 4,
		['Text'] = '下架成功',
		['SystemChannel'] = 0
		},
	[190500430] = {
		['ID'] = 190500430,
		['Type'] = 4,
		['Text'] = '领取收益成功',
		['SystemChannel'] = 0
		},
	[190500431] = {
		['ID'] = 190500431,
		['Type'] = 4,
		['Text'] = '竞价成功',
		['SystemChannel'] = 0
		},
	[190500432] = {
		['ID'] = 190500432,
		['Type'] = 4,
		['Text'] = '不能购买自己的所寄售的道具',
		['SystemChannel'] = 0
		},
	[190500433] = {
		['ID'] = 190500433,
		['Type'] = 4,
		['Text'] = '上架失败，寄售栏已满',
		['SystemChannel'] = 0
		},
	[190500434] = {
		['ID'] = 190500434,
		['Type'] = 4,
		['Text'] = '增加寄售栏成功',
		['SystemChannel'] = 0
		},
	[190500435] = {
		['ID'] = 190500435,
		['Type'] = 4,
		['Text'] = '门宗技能研发完成',
		['SystemChannel'] = 0
		},
	[190500436] = {
		['ID'] = 190500436,
		['Type'] = 4,
		['Text'] = '门宗技能修炼完成',
		['SystemChannel'] = 0
		},
	[190500437] = {
		['ID'] = 190500437,
		['Type'] = 4,
		['Text'] = '门宗名称修改成功',
		['SystemChannel'] = 0
		},
	[190500438] = {
		['ID'] = 190500438,
		['Type'] = 1,
		['Text'] = '门宗副宗主职位已满，提升门宗大厅可以获得更多名额',
		['SystemChannel'] = 0
		},
	[190500439] = {
		['ID'] = 190500439,
		['Type'] = 1,
		['Text'] = '门宗长老职位已满，提升门宗大厅可以获得更多名额',
		['SystemChannel'] = 0
		},
	[190500440] = {
		['ID'] = 190500440,
		['Type'] = 1,
		['Text'] = '门宗成员上限已满，提升门宗大厅可以获得更多名额',
		['SystemChannel'] = 0
		},
	[190500441] = {
		['ID'] = 190500441,
		['Type'] = 4,
		['Text'] = '任命职位成功',
		['SystemChannel'] = 0
		},
	[190500442] = {
		['ID'] = 190500442,
		['Type'] = 4,
		['Text'] = '采集成功',
		['SystemChannel'] = 0
		},
	[190500443] = {
		['ID'] = 190500443,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]已被请离门宗',
		['SystemChannel'] = 0
		},
	[190500444] = {
		['ID'] = 190500444,
		['Type'] = 4,
		['Text'] = '已完成本周的全部门宗内政任务',
		['SystemChannel'] = 0
		},
	[190500445] = {
		['ID'] = 190500445,
		['Type'] = 5,
		['Text'] = 'exp+%d',
		['SystemChannel'] = 0
		},
	[190500446] = {
		['ID'] = 190500446,
		['Type'] = 4,
		['Text'] = '您已被任命为%s职位',
		['SystemChannel'] = 0
		},
	[190500447] = {
		['ID'] = 190500447,
		['Type'] = 4,
		['Text'] = '您已被撤离任命为门众',
		['SystemChannel'] = 0
		},
	[190500448] = {
		['ID'] = 190500448,
		['Type'] = 4,
		['Text'] = '您的银两不足，无法合成',
		['SystemChannel'] = 0
		},
	[190500449] = {
		['ID'] = 190500449,
		['Type'] = 4,
		['Text'] = '宝石数量不足，无法合成',
		['SystemChannel'] = 0
		},
	[190500450] = {
		['ID'] = 190500450,
		['Type'] = 3,
		['Text'] = '[536C85]此次合成包含了绑定与不绑定的宝石，合成后的宝石为绑定状态，是否合成？',
		['SystemChannel'] = 0
		},
	[190500451] = {
		['ID'] = 190500451,
		['Type'] = 1,
		['Text'] = '您的权限不足，无法打开招募成员界面',
		['SystemChannel'] = 0
		},
	[190500452] = {
		['ID'] = 190500452,
		['Type'] = 1,
		['Text'] = '您的权限不足，无法操作入宗审批',
		['SystemChannel'] = 0
		},
	[190500453] = {
		['ID'] = 190500453,
		['Type'] = 1,
		['Text'] = '您的权限不足',
		['SystemChannel'] = 0
		},
	[190500454] = {
		['ID'] = 190500454,
		['Type'] = 1,
		['Text'] = '您的[00ff00]银两[-]不足，无法上架',
		['SystemChannel'] = 0
		},
	[190500455] = {
		['ID'] = 190500455,
		['Type'] = 1,
		['Text'] = '您的[00ff00]元宝[-]不足，该次竞价失败',
		['SystemChannel'] = 0
		},
	[190500456] = {
		['ID'] = 190500456,
		['Type'] = 3,
		['Text'] = '[536C85]阵营战匹配中，当前已等待[00ff00]%s[-]',
		['SystemChannel'] = 0
		},
	[190500457] = {
		['ID'] = 190500457,
		['Type'] = 1,
		['Text'] = '您当日收益次数已达上限，参加将不再获得任何收益',
		['SystemChannel'] = 0
		},
	[190500458] = {
		['ID'] = 190500458,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]加入了门宗',
		['SystemChannel'] = 0
		},
	[190500459] = {
		['ID'] = 190500459,
		['Type'] = 4,
		['Text'] = '已拒绝所有申请玩家',
		['SystemChannel'] = 0
		},
	[190500460] = {
		['ID'] = 190500460,
		['Type'] = 4,
		['Text'] = '已同意所有申请玩家',
		['SystemChannel'] = 0
		},
	[190500461] = {
		['ID'] = 190500461,
		['Type'] = 1,
		['Text'] = '不可超越自己出的竞价',
		['SystemChannel'] = 0
		},
	[190500462] = {
		['ID'] = 190500462,
		['Type'] = 1,
		['Text'] = '门宗已被解散，无法加入',
		['SystemChannel'] = 0
		},
	[190500463] = {
		['ID'] = 190500463,
		['Type'] = 3,
		['Text'] = '[536C85][00ff00]%s[-]邀请您加入门宗，是否同意',
		['SystemChannel'] = 0
		},
	[190500464] = {
		['ID'] = 190500464,
		['Type'] = 1,
		['Text'] = '对方与您不是同一阵营，无法邀请入宗',
		['SystemChannel'] = 0
		},
	[190500465] = {
		['ID'] = 190500465,
		['Type'] = 1,
		['Text'] = '对方还未开启门宗，无法邀请入宗',
		['SystemChannel'] = 0
		},
	[190500466] = {
		['ID'] = 190500466,
		['Type'] = 1,
		['Text'] = '对方还需要等待%s秒后才能加入门宗',
		['SystemChannel'] = 0
		},
	[190500467] = {
		['ID'] = 190500467,
		['Type'] = 1,
		['Text'] = '门宗成员已满，无法加入门宗',
		['SystemChannel'] = 0
		},
	[190500468] = {
		['ID'] = 190500468,
		['Type'] = 4,
		['Text'] = '您已拒绝[00ff00]%s[-]的入宗申请',
		['SystemChannel'] = 0
		},
	[190500469] = {
		['ID'] = 190500469,
		['Type'] = 1,
		['Text'] = '您已有队伍，无法再加入另一个的队伍',
		['SystemChannel'] = 0
		},
	[190500470] = {
		['ID'] = 190500470,
		['Type'] = 1,
		['Text'] = '您已加入门宗，无法再加入另一个的门宗',
		['SystemChannel'] = 0
		},
	[190500471] = {
		['ID'] = 190500471,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定请[00ff00]%s[-]离开门宗',
		['SystemChannel'] = 0
		},
	[190500472] = {
		['ID'] = 190500472,
		['Type'] = 3,
		['Text'] = '[536C85]是否确定转让宗主给[00ff00]%s[-]',
		['SystemChannel'] = 0
		},
	[190500473] = {
		['ID'] = 190500473,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]击杀了[00ff00]%s[-]，已主宰战场！',
		['SystemChannel'] = 0
		},
	[190500474] = {
		['ID'] = 190500474,
		['Type'] = 4,
		['Text'] = '[00ff00]%s[-]击杀超[00ff00]%s[-]个了，无人可挡！',
		['SystemChannel'] = 0
		},
	[190500475] = {
		['ID'] = 190500475,
		['Type'] = 1,
		['Text'] = '阵营战惩罚时间[00ff00]%s[-]秒，暂不可参与',
		['SystemChannel'] = 0
		},
	[190500476] = {
		['ID'] = 190500476,
		['Type'] = 3,
		['Text'] = '[536C85]本次阵营战尚未结束，此时退出将不会获得任何奖励，且3分钟内将无法再次参与匹配，是否退出？',
		['SystemChannel'] = 0
		},
	[190500477] = {
		['ID'] = 190500477,
		['Type'] = 3,
		['Text'] = '[536C85]取消准备，将会获得惩罚，3分钟内将无法再次参与匹配，是否取消？',
		['SystemChannel'] = 0
		},
	[190500478] = {
		['ID'] = 190500478,
		['Type'] = 1,
		['Text'] = '你距离被保护的目标太远，请迅速回援！',
		['SystemChannel'] = 1
		},
	[190500479] = {
		['ID'] = 190500479,
		['Type'] = 1,
		['Text'] = '被保护的目标被攻击，请速速救援！',
		['SystemChannel'] = 1
		},
	[190500480] = {
		['ID'] = 190500480,
		['Type'] = 4,
		['Text'] = '等级不足，无法领取奖励',
		['SystemChannel'] = 0
		},
	[190500481] = {
		['ID'] = 190500481,
		['Type'] = 4,
		['Text'] = '角色数据已损坏，请重新创建新角色，旧角色没用了',
		['SystemChannel'] = 0
		},
	[190500482] = {
		['ID'] = 190500482,
		['Type'] = 1,
		['Text'] = '等级不足，[00ff00]%s[-]功能未开启！',
		['SystemChannel'] = 0
		},
	[190500483] = {
		['ID'] = 190500483,
		['Type'] = 3,
		['Text'] = '[536C85]补签需要消耗[f69e40]%d元宝[-]，是否进行补签',
		['SystemChannel'] = 0
		},
	[190500484] = {
		['ID'] = 190500484,
		['Type'] = 1,
		['Text'] = '门宗资金不足，无法开启活动',
		['SystemChannel'] = 0
		},
	[190500485] = {
		['ID'] = 190500485,
		['Type'] = 1,
		['Text'] = '无法重复开启活动',
		['SystemChannel'] = 0
		},
	[190500486] = {
		['ID'] = 190500486,
		['Type'] = 4,
		['Text'] = '门宗篝火活动已开启，快去门宗领地参与活动，获取经验',
		['SystemChannel'] = 0
		},
	[190500487] = {
		['ID'] = 190500487,
		['Type'] = 1,
		['Text'] = '不在活动时间内，无法开启活动',
		['SystemChannel'] = 0
		},
	[190500488] = {
		['ID'] = 190500488,
		['Type'] = 4,
		['Text'] = '已达最大使用数量，无法再使用',
		['SystemChannel'] = 0
		},
	[190500489] = {
		['ID'] = 190500489,
		['Type'] = 3,
		['Text'] = '您好，本轮游历已经完成，是否进行新一轮游历？',
		['SystemChannel'] = 0
		},
	[190500490] = {
		['ID'] = 190500490,
		['Type'] = 4,
		['Text'] = '今日游历已经完成，请进行其他活动或任务。',
		['SystemChannel'] = 0
		},
	[190500491] = {
		['ID'] = 190500491,
		['Type'] = 3,
		['Text'] = '[f69e40]%s[-]不足，剩余部分需使用[f69e40]%s[-]替代，是否确使用？',
		['SystemChannel'] = 0
		},
	[190500492] = {
		['ID'] = 190500492,
		['Type'] = 4,
		['Text'] = '回答正确，获得额外奖励',
		['SystemChannel'] = 0
		},
	[190500493] = {
		['ID'] = 190500493,
		['Type'] = 1,
		['Text'] = '背包空位不足，无法打开',
		['SystemChannel'] = 0
		},
	[190500494] = {
		['ID'] = 190500494,
		['Type'] = 3,
		['Text'] = '缺少%s宝箱，是否去[2c9124]商城[-]购买',
		['SystemChannel'] = 0
		},
	[190500495] = {
		['ID'] = 190500495,
		['Type'] = 1,
		['Text'] = '您的摇钱树剩余次数不足',
		['SystemChannel'] = 0
		},
	[190500496] = {
		['ID'] = 190500496,
		['Type'] = 3,
		['Text'] = '您的银票不足，是否前往兑换银票',
		['SystemChannel'] = 0
		},
	[190500497] = {
		['ID'] = 190500497,
		['Type'] = 3,
		['Text'] = '您的元宝不足，是否前往进行充值',
		['SystemChannel'] = 0
		},
	[190500498] = {
		['ID'] = 190500498,
		['Type'] = 1,
		['Text'] = '您的银币不足',
		['SystemChannel'] = 0
		},
	[190500499] = {
		['ID'] = 190500499,
		['Type'] = 4,
		['Text'] = '您的门宗获得了[40f765]%d[-]门宗资金',
		['SystemChannel'] = 0
		},
	[190500500] = {
		['ID'] = 190500500,
		['Type'] = 1,
		['Text'] = '[f69e40]%s[-]占领了[f69e40]%s[-]，阵营优势再度扩大!',
		['SystemChannel'] = 0
		},
	[190500501] = {
		['ID'] = 190500501,
		['Type'] = 1,
		['Text'] = '您被[f69e40]%s[-]击败，积分掉落[f69e40]%s[-]！',
		['SystemChannel'] = 0
		},
	[190500502] = {
		['ID'] = 190500502,
		['Type'] = 1,
		['Text'] = '[f69e40]%s[-]的矿车已经满载开始护送！',
		['SystemChannel'] = 0
		},
	[190500503] = {
		['ID'] = 190500503,
		['Type'] = 1,
		['Text'] = '[f69e40]%s[-]的矿车被摧毁在[f69e40]%s[-]！',
		['SystemChannel'] = 0
		},
	[190500504] = {
		['ID'] = 190500504,
		['Type'] = 1,
		['Text'] = '[f69e40]%s[-]的矿车正在受到攻击！',
		['SystemChannel'] = 0
		},
	[190500505] = {
		['ID'] = 190500505,
		['Type'] = 3,
		['Text'] = '[536C85]普通找回只有完美找回的[f69e40]70%[-]奖励，是否确定找回',
		['SystemChannel'] = 0
		},
	[190500506] = {
		['ID'] = 190500506,
		['Type'] = 1,
		['Text'] = '每天[f69e40]%s[-]可参加轻松答题，在界面栏中回答20道题目。每周六[f69e40]%s[-]举行大千世界答题活动，在限有时间内完成活动即有机会争夺荣誉和称号。',
		['SystemChannel'] = 0
		},
	[190500507] = {
		['ID'] = 190500507,
		['Type'] = 1,
		['Text'] = '钥匙不足，无法开启宝箱',
		['SystemChannel'] = 0
		},
	[190500508] = {
		['ID'] = 190500508,
		['Type'] = 3,
		['Text'] = '暂未通关该层，此时退出将不会获得任何奖励，您确定要离开吗？',
		['SystemChannel'] = 0
		},
	[190500509] = {
		['ID'] = 190500509,
		['Type'] = 1,
		['Text'] = '排行榜[f69e40]%s[-]天结算一次排行奖励，结算当天的21:00，奖励内容以邮件发给对应名次的玩家',
		['SystemChannel'] = 0
		},
	[190500510] = {
		['ID'] = 190500510,
		['Type'] = 4,
		['Text'] = '这是敌对阵营的押镖NPC',
		['SystemChannel'] = 0
		},
	[190500511] = {
		['ID'] = 190500511,
		['Type'] = 5,
		['Text'] = '您被[f69e40]%s[-]击杀，积分掉落[f69e40]%s[-]!',
		['SystemChannel'] = 0
		},
	[190500512] = {
		['ID'] = 190500512,
		['Type'] = 5,
		['Text'] = '[f69e40]%s[-]的矿车已经满载开始护送！',
		['SystemChannel'] = 0
		},
	[190500513] = {
		['ID'] = 190500513,
		['Type'] = 5,
		['Text'] = '[f69e40]%s[-]的矿车被摧毁在[f69e40]%s[-]！',
		['SystemChannel'] = 0
		},
	[190500514] = {
		['ID'] = 190500514,
		['Type'] = 5,
		['Text'] = '[f69e40]%s[-]的矿车正在遭受攻击！',
		['SystemChannel'] = 0
		},
	[190500515] = {
		['ID'] = 190500515,
		['Type'] = 5,
		['Text'] = '[f69e40]%s[-]的矿车成功护送至目的地！',
		['SystemChannel'] = 0
		},
	[190500516] = {
		['ID'] = 190500516,
		['Type'] = 1,
		['Text'] = '今日次数已用完！',
		['SystemChannel'] = 0
		},
	[190500517] = {
		['ID'] = 190500517,
		['Type'] = 3,
		['Text'] = '每次追踪生效20分钟，20分钟内您可以查看仇人的位置坐标，也可以通过场景地图找到他，只能查看位于主城或者野外的仇人位置坐标',
		['SystemChannel'] = 0
		},
	[190500518] = {
		['ID'] = 190500518,
		['Type'] = 4,
		['Text'] = '您的追缉令不足，无法进行追踪',
		['SystemChannel'] = 0
		},
	[190500519] = {
		['ID'] = 190500519,
		['Type'] = 1,
		['Text'] = '追踪到%s所在位置为：%s',
		['SystemChannel'] = 0
		},
	[190500520] = {
		['ID'] = 190500520,
		['Type'] = 4,
		['Text'] = '对方不在主城或者野外，暂时无法追踪其位置',
		['SystemChannel'] = 0
		},
	[190500521] = {
		['ID'] = 190500521,
		['Type'] = 3,
		['Text'] = '[536C85]花费[f69e40]%s元宝[-]摇动[f69e40]十次[-]，是否确定使用？',
		['SystemChannel'] = 0
		},
	[190500522] = {
		['ID'] = 190500522,
		['Type'] = 1,
		['Text'] = '仇人目前不在线，无法使用追踪',
		['SystemChannel'] = 0
		},
	[190500523] = {
		['ID'] = 190500523,
		['Type'] = 1,
		['Text'] = '兑换获得的数量将超出持有上限，请减少兑换次数',
		['SystemChannel'] = 0
		},
	[190500524] = {
		['ID'] = 190500524,
		['Type'] = 1,
		['Text'] = '银币不足，无法兑换',
		['SystemChannel'] = 0
		},
	[190500525] = {
		['ID'] = 190500525,
		['Type'] = 3,
		['Text'] = '您的元宝不足，是否前往充值',
		['SystemChannel'] = 0
		},
	[190500526] = {
		['ID'] = 190500526,
		['Type'] = 4,
		['Text'] = '您获得了[40f765]%d[-]银币',
		['SystemChannel'] = 1
		},
	[190500527] = {
		['ID'] = 190500527,
		['Type'] = 3,
		['Text'] = '门宗篝火活动开启了，快来参加获取经验吧！',
		['SystemChannel'] = 0
		},
	[190500528] = {
		['ID'] = 190500528,
		['Type'] = 6,
		['Text'] = '[00ff00]%s[-]向您赠送了[40f765]%s[-]个%s，请前往邮箱领取，是否回赠礼物',
		['SystemChannel'] = 0
		}
	}
return ErrorBoxTable
