local EscortTask = {
	[46000001] = {
		['ID'] = 46000001,	--索引
		['NpcID'] = 151001020,	--护送任务相关NPC
		['Scene'] = 20008,	--目标地图
		['Time'] = 600,	--护送时间
		['Team'] = 1,	--是否组队共享
		['Distance'] = 10,	--距离检测
		['BlockedStop'] = 1,	--是否被攻击后停下
		['MonsterID1'] = {240720029,240720030,240720031,240720032,240720033,240720034},	--刷怪表ID（ID组）1
		['PointXZ1'] = {-1,-79},	--触发坐标（组）1
		['MonsterID2'] = {0},	--刷怪表ID（ID组）2
		['PointXZ2'] = {0},	--触发坐标（组）2
		['MonsterID3'] = {0},	--刷怪表ID（ID组）3
		['PointXZ3'] = {0},	--触发坐标（组）3
		['talkID'] = {156000004,156000005}	--触发说话
		}
	}
return EscortTask
