local FishingTable = {
	[440400001] = {
		['ID'] = 440400001,	--索引
		['Stosh'] = 201061243,	--鱼饵道具
		['TimeMin'] = 2,	--最短时间
		['TimeMax'] = 8,	--最长时间
		['Response'] = 3,	--有效时间
		['Drop'] = 220100241,	--奖励掉落
		['Drop1'] = 220100241	--基础掉落
		},
	[440400002] = {
		['ID'] = 440400002,
		['Stosh'] = 201061244,
		['TimeMin'] = 2,
		['TimeMax'] = 8,
		['Response'] = 3,
		['Drop'] = 220100242,
		['Drop1'] = 220100241
		},
	[440400003] = {
		['ID'] = 440400003,
		['Stosh'] = 201061245,
		['TimeMin'] = 2,
		['TimeMax'] = 8,
		['Response'] = 2,
		['Drop'] = 220100243,
		['Drop1'] = 220100241
		},
	[440400004] = {
		['ID'] = 440400004,
		['Stosh'] = 201061246,
		['TimeMin'] = 2,
		['TimeMax'] = 8,
		['Response'] = 2,
		['Drop'] = 220100244,
		['Drop1'] = 220100241
		},
	[440400005] = {
		['ID'] = 440400005,
		['Stosh'] = 201061247,
		['TimeMin'] = 2,
		['TimeMax'] = 8,
		['Response'] = 1,
		['Drop'] = 220100245,
		['Drop1'] = 220100241
		},
	[440400006] = {
		['ID'] = 440400006,
		['Stosh'] = 201061248,
		['TimeMin'] = 2,
		['TimeMax'] = 8,
		['Response'] = 1,
		['Drop'] = 220100245,
		['Drop1'] = 220100241
		}
	}
return FishingTable
