local GangsBuildTaskTable = {
	[340500001] = {
		['ID'] = 340500001,	--索引
		['Level'] = {1,10},	--等级段
		['Tasklibrary'] = {240191006,240191007,240191008},	--任务库
		['DropID'] = 220100013,	--掉落ID
		['LeveTime'] = 180,	--建设度
		['Times'] = 40	--
		},
	[340500001] = {
		['ID'] = 340500001,
		['Level'] = {11,20},
		['Tasklibrary'] = {240191006,240191007,240191008},
		['DropID'] = 220100014,
		['LeveTime'] = 360,
		['Times'] = 40
		},
	[340500002] = {
		['ID'] = 340500002,
		['Level'] = {21,30},
		['Tasklibrary'] = {240191006,240191007,240191008},
		['DropID'] = 220100015,
		['LeveTime'] = 720,
		['Times'] = 40
		},
	[340500003] = {
		['ID'] = 340500003,
		['Level'] = {31,100},
		['Tasklibrary'] = {240191006,240191007,240191008},
		['DropID'] = 220100016,
		['LeveTime'] = 1440,
		['Times'] = 40
		}
	}
return GangsBuildTaskTable
