local NoticeTable = {
	[330500001] = {
		['ID'] = 330500001,	--索引
		['Priority'] = 3,	--播放优先级
		['Way'] = 2,	--播放方式
		['NoticeDay'] = {1,2,3,4,5,6,0},	--公告日
		['NoticeTime'] = {958},	--公告时间
		['NoticeTxt'] = '测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1测试公告1'	--公告内容
		},
	[330500002] = {
		['ID'] = 330500002,
		['Priority'] = 2,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {959},
		['NoticeTxt'] = '测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2测试公告2'
		},
	[330500003] = {
		['ID'] = 330500003,
		['Priority'] = 1,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {910},
		['NoticeTxt'] = '测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3测试公告3'
		},
	[330500004] = {
		['ID'] = 330500004,
		['Priority'] = 1,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {959},
		['NoticeTxt'] = '测试公告4'
		},
	[330500005] = {
		['ID'] = 330500005,
		['Priority'] = 2,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {1005},
		['NoticeTxt'] = '测试公告5'
		},
	[330500006] = {
		['ID'] = 330500006,
		['Priority'] = 2,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {1010},
		['NoticeTxt'] = '测试公告6'
		},
	[330500007] = {
		['ID'] = 330500007,
		['Priority'] = 2,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {1015},
		['NoticeTxt'] = '测试公告7'
		},
	[330500008] = {
		['ID'] = 330500008,
		['Priority'] = 2,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {1020},
		['NoticeTxt'] = '测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放测试公告一01分播放'
		},
	[330500009] = {
		['ID'] = 330500009,
		['Priority'] = 1,
		['Way'] = 2,
		['NoticeDay'] = {1,2,3,4,5,6,0},
		['NoticeTime'] = {1025},
		['NoticeTxt'] = '测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放测试公告二01分播放'
		},
	[330510001] = {
		['ID'] = 330510001,
		['Priority'] = 1,
		['Way'] = 1,
		['NoticeDay'] = {},
		['NoticeTime'] = {},
		['NoticeTxt'] = '恭喜%s已达到100级'
		},
	[330510002] = {
		['ID'] = 330510002,
		['Priority'] = 1,
		['Way'] = 1,
		['NoticeDay'] = {},
		['NoticeTime'] = {},
		['NoticeTxt'] = '恭喜%s装备已达满星'
		},
	[330510003] = {
		['ID'] = 330510003,
		['Priority'] = 1,
		['Way'] = 1,
		['NoticeDay'] = {},
		['NoticeTime'] = {},
		['NoticeTxt'] = '%s杀戮值过高已进入红名模式'
		}
	}
return NoticeTable
