local NpcShopTable = {
	[661000001] = {
		['ID'] = 661000001,	--索引
		['NpcID'] = 152007015,	--NPCID
		['ShopIDName'] = '八宝郡商店',	--商店ID
		['ShopID'] = 1,	--商店ID
		['Goods'] = 281010001	--商品
		},
	[661000002] = {
		['ID'] = 661000002,
		['NpcID'] = 152007015,
		['ShopIDName'] = '八宝郡商店',
		['ShopID'] = 1,
		['Goods'] = 281010002
		},
	[661000003] = {
		['ID'] = 661000003,
		['NpcID'] = 152007015,
		['ShopIDName'] = '八宝郡商店',
		['ShopID'] = 1,
		['Goods'] = 281010003
		},
	[661000004] = {
		['ID'] = 661000004,
		['NpcID'] = 152007015,
		['ShopIDName'] = '八宝郡商店',
		['ShopID'] = 1,
		['Goods'] = 281010004
		},
	[661000005] = {
		['ID'] = 661000005,
		['NpcID'] = 152007015,
		['ShopIDName'] = '八宝郡商店',
		['ShopID'] = 1,
		['Goods'] = 281010005
		},
	[661000006] = {
		['ID'] = 661000006,
		['NpcID'] = 152007015,
		['ShopIDName'] = '八宝郡商店',
		['ShopID'] = 1,
		['Goods'] = 281010006
		},
	[661000007] = {
		['ID'] = 661000007,
		['NpcID'] = 152007017,
		['ShopIDName'] = '神秘的商店',
		['ShopID'] = 2,
		['Goods'] = 281010007
		},
	[661000008] = {
		['ID'] = 661000008,
		['NpcID'] = 152007017,
		['ShopIDName'] = '神秘的商店',
		['ShopID'] = 2,
		['Goods'] = 281010008
		},
	[661000009] = {
		['ID'] = 661000009,
		['NpcID'] = 152007017,
		['ShopIDName'] = '神秘的商店',
		['ShopID'] = 2,
		['Goods'] = 281010009
		},
	[661000010] = {
		['ID'] = 661000010,
		['NpcID'] = 152007017,
		['ShopIDName'] = '神秘的商店',
		['ShopID'] = 2,
		['Goods'] = 281010010
		},
	[661000011] = {
		['ID'] = 661000011,
		['NpcID'] = 152007017,
		['ShopIDName'] = '神秘的商店',
		['ShopID'] = 2,
		['Goods'] = 281010011
		},
	[661000012] = {
		['ID'] = 661000012,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010012
		},
	[661000013] = {
		['ID'] = 661000013,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010013
		},
	[661000014] = {
		['ID'] = 661000014,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010014
		},
	[661000015] = {
		['ID'] = 661000015,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010015
		},
	[661000016] = {
		['ID'] = 661000016,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010016
		},
	[661000017] = {
		['ID'] = 661000017,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010017
		},
	[661000018] = {
		['ID'] = 661000018,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010018
		},
	[661000019] = {
		['ID'] = 661000019,
		['NpcID'] = 152007018,
		['ShopIDName'] = '超级商店',
		['ShopID'] = 3,
		['Goods'] = 281010019
		}
	}
return NpcShopTable
