local P20039Table = {
	[350801001] = {
		['ID'] = 350801001,	--索引
		['TypeID'] = 5,	--脚本ID
		['Parameter1'] = {152060024},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[350801002] = {
		['ID'] = 350801002,
		['TypeID'] = 5,
		['Parameter1'] = {152060025},
		['Parameter2'] = {''}
		},
	[350801003] = {
		['ID'] = 350801003,
		['TypeID'] = 5,
		['Parameter1'] = {152060026},
		['Parameter2'] = {''}
		},
	[350801004] = {
		['ID'] = 350801004,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801005] = {
		['ID'] = 350801005,
		['TypeID'] = 2,
		['Parameter1'] = {151005063,151005065},
		['Parameter2'] = {''}
		},
	[350801006] = {
		['ID'] = 350801006,
		['TypeID'] = 2,
		['Parameter1'] = {151005064,151005066},
		['Parameter2'] = {''}
		},
	[350801007] = {
		['ID'] = 350801007,
		['TypeID'] = 2,
		['Parameter1'] = {151001003,151001004},
		['Parameter2'] = {''}
		},
	[350801012] = {
		['ID'] = 350801012,
		['TypeID'] = 10,
		['Parameter1'] = {151005063,16},
		['Parameter2'] = {''}
		},
	[350801013] = {
		['ID'] = 350801013,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801014] = {
		['ID'] = 350801014,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801015] = {
		['ID'] = 350801015,
		['TypeID'] = 20,
		['Parameter1'] = {152060024},
		['Parameter2'] = {'Attack01'}
		},
	[350801016] = {
		['ID'] = 350801016,
		['TypeID'] = 18,
		['Parameter1'] = {2000801},
		['Parameter2'] = {''}
		},
	[350801017] = {
		['ID'] = 350801017,
		['TypeID'] = 10,
		['Parameter1'] = {151005064,20},
		['Parameter2'] = {''}
		},
	[350801018] = {
		['ID'] = 350801018,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801019] = {
		['ID'] = 350801019,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801020] = {
		['ID'] = 350801020,
		['TypeID'] = 20,
		['Parameter1'] = {152060025},
		['Parameter2'] = {'Attack01'}
		},
	[350801021] = {
		['ID'] = 350801021,
		['TypeID'] = 18,
		['Parameter1'] = {2000802},
		['Parameter2'] = {''}
		},
	[350801022] = {
		['ID'] = 350801022,
		['TypeID'] = 10,
		['Parameter1'] = {151005066,15},
		['Parameter2'] = {''}
		},
	[350801023] = {
		['ID'] = 350801023,
		['TypeID'] = 2,
		['Parameter1'] = {151005067},
		['Parameter2'] = {''}
		},
	[350801024] = {
		['ID'] = 350801024,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801025] = {
		['ID'] = 350801025,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350801026] = {
		['ID'] = 350801026,
		['TypeID'] = 10,
		['Parameter1'] = {151005067,1},
		['Parameter2'] = {''}
		},
	[350801027] = {
		['ID'] = 350801027,
		['TypeID'] = 9,
		['Parameter1'] = {2},
		['Parameter2'] = {''}
		},
	[350801028] = {
		['ID'] = 350801028,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20039Table
