local P20019Table = {
	[350501001] = {
		['ID'] = 350501001,	--索引
		['TypeID'] = 17,	--脚本ID
		['Parameter1'] = {1},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[350501002] = {
		['ID'] = 350501002,
		['TypeID'] = 5,
		['Parameter1'] = {152000061},
		['Parameter2'] = {''}
		},
	[350501003] = {
		['ID'] = 350501003,
		['TypeID'] = 41,
		['Parameter1'] = {152000061},
		['Parameter2'] = {''}
		},
	[350501004] = {
		['ID'] = 350501004,
		['TypeID'] = 19,
		['Parameter1'] = {152000061},
		['Parameter2'] = {''}
		},
	[350501005] = {
		['ID'] = 350501005,
		['TypeID'] = 31,
		['Parameter1'] = {46000002},
		['Parameter2'] = {''}
		},
	[350501006] = {
		['ID'] = 350501006,
		['TypeID'] = 2,
		['Parameter1'] = {151005002},
		['Parameter2'] = {''}
		},
	[350501007] = {
		['ID'] = 350501007,
		['TypeID'] = 2,
		['Parameter1'] = {151005003},
		['Parameter2'] = {''}
		},
	[350501008] = {
		['ID'] = 350501008,
		['TypeID'] = 2,
		['Parameter1'] = {151005004},
		['Parameter2'] = {''}
		},
	[350501009] = {
		['ID'] = 350501009,
		['TypeID'] = 2,
		['Parameter1'] = {151005005},
		['Parameter2'] = {''}
		},
	[350501010] = {
		['ID'] = 350501010,
		['TypeID'] = 2,
		['Parameter1'] = {151005006},
		['Parameter2'] = {''}
		},
	[350501011] = {
		['ID'] = 350501011,
		['TypeID'] = 2,
		['Parameter1'] = {151005007},
		['Parameter2'] = {''}
		},
	[350501012] = {
		['ID'] = 350501012,
		['TypeID'] = 2,
		['Parameter1'] = {151005008},
		['Parameter2'] = {''}
		},
	[350501013] = {
		['ID'] = 350501013,
		['TypeID'] = 30,
		['Parameter1'] = {46000002,0,1},
		['Parameter2'] = {'P20119Table'}
		},
	[350501014] = {
		['ID'] = 350501014,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20019Table
