local P20020Table = {
	[350601001] = {
		['ID'] = 350601001,	--索引
		['TypeID'] = 2,	--脚本ID
		['Parameter1'] = {151005022},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[350601002] = {
		['ID'] = 350601002,
		['TypeID'] = 2,
		['Parameter1'] = {151005023},
		['Parameter2'] = {''}
		},
	[350601003] = {
		['ID'] = 350601003,
		['TypeID'] = 2,
		['Parameter1'] = {151005024},
		['Parameter2'] = {''}
		},
	[350601004] = {
		['ID'] = 350601004,
		['TypeID'] = 2,
		['Parameter1'] = {151005025},
		['Parameter2'] = {''}
		},
	[350601005] = {
		['ID'] = 350601005,
		['TypeID'] = 2,
		['Parameter1'] = {151005026},
		['Parameter2'] = {''}
		},
	[350601006] = {
		['ID'] = 350601006,
		['TypeID'] = 13,
		['Parameter1'] = {151005026,0},
		['Parameter2'] = {''}
		},
	[350601007] = {
		['ID'] = 350601007,
		['TypeID'] = 2,
		['Parameter1'] = {151005027},
		['Parameter2'] = {''}
		},
	[350601008] = {
		['ID'] = 350601008,
		['TypeID'] = 10,
		['Parameter1'] = {151005027,1},
		['Parameter2'] = {''}
		},
	[350601009] = {
		['ID'] = 350601009,
		['TypeID'] = 9,
		['Parameter1'] = {2},
		['Parameter2'] = {''}
		},
	[350601010] = {
		['ID'] = 350601010,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20020Table
