local P20002Table = {
	[350102001] = {
		['ID'] = 350102001,	--索引
		['TypeID'] = 22,	--脚本ID
		['Parameter1'] = {240190011},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[350102002] = {
		['ID'] = 350102002,
		['TypeID'] = 31,
		['Parameter1'] = {46000001},
		['Parameter2'] = {''}
		},
	[350102003] = {
		['ID'] = 350102003,
		['TypeID'] = 19,
		['Parameter1'] = {152060022},
		['Parameter2'] = {''}
		},
	[350102004] = {
		['ID'] = 350102004,
		['TypeID'] = 2,
		['Parameter1'] = {151001017,151001018},
		['Parameter2'] = {''}
		},
	[350102005] = {
		['ID'] = 350102005,
		['TypeID'] = 30,
		['Parameter1'] = {46000001,0,1},
		['Parameter2'] = {'P20003Table'}
		},
	[350102006] = {
		['ID'] = 350102006,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[350102007] = {
		['ID'] = 350102007,
		['TypeID'] = 2,
		['Parameter1'] = {151001016},
		['Parameter2'] = {''}
		},
	[350102008] = {
		['ID'] = 350102008,
		['TypeID'] = 29,
		['Parameter1'] = {2},
		['Parameter2'] = {''}
		},
	[350102009] = {
		['ID'] = 350102009,
		['TypeID'] = 13,
		['Parameter1'] = {151001016,0},
		['Parameter2'] = {''}
		},
	[350102010] = {
		['ID'] = 350102010,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20002Table
