local P20002Table = {
	[380102001] = {
		['ID'] = 380102001,	--索引
		['TypeID'] = 22,	--脚本ID
		['Parameter1'] = {240190011},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[380102002] = {
		['ID'] = 380102002,
		['TypeID'] = 31,
		['Parameter1'] = {46000001},
		['Parameter2'] = {''}
		},
	[380102003] = {
		['ID'] = 380102003,
		['TypeID'] = 19,
		['Parameter1'] = {152060022},
		['Parameter2'] = {''}
		},
	[380102004] = {
		['ID'] = 380102004,
		['TypeID'] = 2,
		['Parameter1'] = {151001017,151001018},
		['Parameter2'] = {''}
		},
	[380102005] = {
		['ID'] = 380102005,
		['TypeID'] = 30,
		['Parameter1'] = {46000001,0,1},
		['Parameter2'] = {'P20003Table'}
		},
	[380102006] = {
		['ID'] = 380102006,
		['TypeID'] = 9,
		['Parameter1'] = {1},
		['Parameter2'] = {''}
		},
	[380102007] = {
		['ID'] = 380102007,
		['TypeID'] = 17,
		['Parameter1'] = {2000804},
		['Parameter2'] = {''}
		},
	[380102008] = {
		['ID'] = 380102008,
		['TypeID'] = 19,
		['Parameter1'] = {152060017},
		['Parameter2'] = {''}
		},
	[380102009] = {
		['ID'] = 380102009,
		['TypeID'] = 5,
		['Parameter1'] = {152060017},
		['Parameter2'] = {''}
		},
	[380102010] = {
		['ID'] = 380102010,
		['TypeID'] = 2,
		['Parameter1'] = {151001016},
		['Parameter2'] = {''}
		},
	[380102011] = {
		['ID'] = 380102011,
		['TypeID'] = 29,
		['Parameter1'] = {2},
		['Parameter2'] = {''}
		},
	[380102012] = {
		['ID'] = 380102012,
		['TypeID'] = 13,
		['Parameter1'] = {151001016,0},
		['Parameter2'] = {''}
		},
	[380102013] = {
		['ID'] = 380102013,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20002Table
