local P20018Table = {
	[350401001] = {
		['ID'] = 350401001,	--索引
		['TypeID'] = 4,	--脚本ID
		['Parameter1'] = {154000011},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[350401002] = {
		['ID'] = 350401002,
		['TypeID'] = 2,
		['Parameter1'] = {151005019},
		['Parameter2'] = {''}
		},
	[350401003] = {
		['ID'] = 350401003,
		['TypeID'] = 2,
		['Parameter1'] = {151005020},
		['Parameter2'] = {''}
		},
	[350401004] = {
		['ID'] = 350401004,
		['TypeID'] = 12,
		['Parameter1'] = {154000011,5},
		['Parameter2'] = {''}
		},
	[350401005] = {
		['ID'] = 350401005,
		['TypeID'] = 2,
		['Parameter1'] = {151005021},
		['Parameter2'] = {''}
		},
	[350401006] = {
		['ID'] = 350401006,
		['TypeID'] = 2,
		['Parameter1'] = {151005046},
		['Parameter2'] = {''}
		},
	[350401007] = {
		['ID'] = 350401007,
		['TypeID'] = 2,
		['Parameter1'] = {151005047},
		['Parameter2'] = {''}
		},
	[350401008] = {
		['ID'] = 350401008,
		['TypeID'] = 12,
		['Parameter1'] = {154000011,30},
		['Parameter2'] = {''}
		},
	[350401009] = {
		['ID'] = 350401009,
		['TypeID'] = 9,
		['Parameter1'] = {2},
		['Parameter2'] = {''}
		},
	[350401010] = {
		['ID'] = 350401010,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P20018Table
