local P200242Table = {
	[3501902001] = {
		['ID'] = 3501902001,	--索引
		['TypeID'] = 21,	--脚本ID
		['Parameter1'] = {450000059},	--参数1
		['Parameter2'] = {''}	--参数2
		},
	[3501902002] = {
		['ID'] = 3501902002,
		['TypeID'] = 17,
		['Parameter1'] = {2004205},
		['Parameter2'] = {''}
		},
	[3501902003] = {
		['ID'] = 3501902003,
		['TypeID'] = 1,
		['Parameter1'] = {151077053,1},
		['Parameter2'] = {''}
		},
	[3501902004] = {
		['ID'] = 3501902004,
		['TypeID'] = 42,
		['Parameter1'] = {151077053,20},
		['Parameter2'] = {''}
		},
	[3501902005] = {
		['ID'] = 3501902005,
		['TypeID'] = 46,
		['Parameter1'] = {151077053},
		['Parameter2'] = {''}
		},
	[3501902006] = {
		['ID'] = 3501902006,
		['TypeID'] = 21,
		['Parameter1'] = {450000049},
		['Parameter2'] = {''}
		},
	[3501902007] = {
		['ID'] = 3501902007,
		['TypeID'] = 9,
		['Parameter1'] = {3.5},
		['Parameter2'] = {''}
		},
	[3501902008] = {
		['ID'] = 3501902008,
		['TypeID'] = 27,
		['Parameter1'] = {},
		['Parameter2'] = {''}
		}
	}
return P200242Table
