local ParameterTable = {
	[161000001] = {
		['ID'] = 161000001,	--索引
		['parameter1'] = {7,2,4,3,5,6,8},	--参数1
		['parameter2'] = ''	--参数2
		},
	[162000001] = {
		['ID'] = 162000001,
		['parameter1'] = {100,2},
		['parameter2'] = ''
		},
	[163000001] = {
		['ID'] = 163000001,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000002] = {
		['ID'] = 161000002,
		['parameter1'] = {201070017,1},
		['parameter2'] = ''
		},
	[161000003] = {
		['ID'] = 161000003,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000004] = {
		['ID'] = 161000004,
		['parameter1'] = {1,100},
		['parameter2'] = ''
		},
	[161000005] = {
		['ID'] = 161000005,
		['parameter1'] = {0,30,5,0,0,10,0,5,0,0},
		['parameter2'] = ''
		},
	[161000006] = {
		['ID'] = 161000006,
		['parameter1'] = {120},
		['parameter2'] = ''
		},
	[161000007] = {
		['ID'] = 161000007,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000008] = {
		['ID'] = 161000008,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000009] = {
		['ID'] = 161000009,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000010] = {
		['ID'] = 161000010,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000011] = {
		['ID'] = 161000011,
		['parameter1'] = {50},
		['parameter2'] = ''
		},
	[161000012] = {
		['ID'] = 161000012,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000013] = {
		['ID'] = 161000013,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000014] = {
		['ID'] = 161000014,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000015] = {
		['ID'] = 161000015,
		['parameter1'] = {5,10},
		['parameter2'] = ''
		},
	[161000016] = {
		['ID'] = 161000016,
		['parameter1'] = {},
		['parameter2'] = '深入妖谷'
		},
	[161000017] = {
		['ID'] = 161000017,
		['parameter1'] = {},
		['parameter2'] = '太极之巅'
		},
	[161000018] = {
		['ID'] = 161000018,
		['parameter1'] = {},
		['parameter2'] = '待启用副本'
		},
	[161000019] = {
		['ID'] = 161000019,
		['parameter1'] = {20000},
		['parameter2'] = ''
		},
	[161000020] = {
		['ID'] = 161000020,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000021] = {
		['ID'] = 161000021,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000022] = {
		['ID'] = 161000022,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000023] = {
		['ID'] = 161000023,
		['parameter1'] = {10012,107,22,86},
		['parameter2'] = ''
		},
	[161000024] = {
		['ID'] = 161000024,
		['parameter1'] = {201060016,1},
		['parameter2'] = ''
		},
	[161000025] = {
		['ID'] = 161000025,
		['parameter1'] = {201060017,1},
		['parameter2'] = ''
		},
	[161000026] = {
		['ID'] = 161000026,
		['parameter1'] = {4},
		['parameter2'] = ''
		},
	[161000027] = {
		['ID'] = 161000027,
		['parameter1'] = {130200022},
		['parameter2'] = ''
		},
	[161000028] = {
		['ID'] = 161000028,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000029] = {
		['ID'] = 161000029,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000030] = {
		['ID'] = 161000030,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000031] = {
		['ID'] = 161000031,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000032] = {
		['ID'] = 161000032,
		['parameter1'] = {},
		['parameter2'] = '每周根据卡片收集情况给予奖励：\n\n1张    1000银两礼包*1\n2张   1000银两礼包*2\n3张   1000银两礼包*3\n4张   1000银两礼包*4\n5张   1000银两礼包*5\n6张   1000银两礼包*6\n\n[F69E40]1000银两礼包内含1000银两，就这样而已[-]'
		},
	[161000033] = {
		['ID'] = 161000033,
		['parameter1'] = {20,30,40,50,60},
		['parameter2'] = ''
		},
	[161000034] = {
		['ID'] = 161000034,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000035] = {
		['ID'] = 161000035,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000036] = {
		['ID'] = 161000036,
		['parameter1'] = {25},
		['parameter2'] = ''
		},
	[161000037] = {
		['ID'] = 161000037,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000038] = {
		['ID'] = 161000038,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000039] = {
		['ID'] = 161000039,
		['parameter1'] = {0},
		['parameter2'] = '活动时间：每天开放，紧急悬赏在每天中午12点有几率出现；\n\n任务形式：处于组队状态下单人或者多人参加；\n\n收益次数：每天进入次数不限，但只能获得2次收益次数，所有悬赏共用收益次数；\n\n完成条件：在任务限定时间内进入副本找到并击杀悬赏目标\n\n失败条件：任务限定时间内仍未完成击杀悬赏目标，任务失败；\n\n注意事项：1、只要任务限时未结束，玩家可以无限次进出副本击杀悬赏目标；\n                  2、每次进入副本，BOSS均会在副本内随机位置出现，需要尽快寻找；\n                  3、一旦任务超时失败，即使击杀了悬赏目标，也无法获得奖励；\n\n任务内容：进入随机副本寻找悬赏目标，在任务限时内将其击杀则可以顺利完成国御悬赏。'
		},
	[161000040] = {
		['ID'] = 161000040,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000041] = {
		['ID'] = 161000041,
		['parameter1'] = {201060024,4},
		['parameter2'] = ''
		},
	[161000042] = {
		['ID'] = 161000042,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000043] = {
		['ID'] = 161000043,
		['parameter1'] = {0},
		['parameter2'] = ''
		},
	[161000044] = {
		['ID'] = 161000044,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		},
	[161000045] = {
		['ID'] = 161000045,
		['parameter1'] = {0.1},
		['parameter2'] = ''
		},
	[161000046] = {
		['ID'] = 161000046,
		['parameter1'] = {0.2},
		['parameter2'] = ''
		},
	[161000047] = {
		['ID'] = 161000047,
		['parameter1'] = {0.8},
		['parameter2'] = ''
		},
	[161000048] = {
		['ID'] = 161000048,
		['parameter1'] = {0.2},
		['parameter2'] = ''
		},
	[161000049] = {
		['ID'] = 161000049,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		},
	[161000050] = {
		['ID'] = 161000050,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000051] = {
		['ID'] = 161000051,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000052] = {
		['ID'] = 161000052,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000053] = {
		['ID'] = 161000053,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000054] = {
		['ID'] = 161000054,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000055] = {
		['ID'] = 161000055,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000056] = {
		['ID'] = 161000056,
		['parameter1'] = {-2,2},
		['parameter2'] = ''
		},
	[161000057] = {
		['ID'] = 161000057,
		['parameter1'] = {-5,5},
		['parameter2'] = ''
		},
	[161000058] = {
		['ID'] = 161000058,
		['parameter1'] = {20021,90,28,63,-90,1},
		['parameter2'] = ''
		},
	[161000059] = {
		['ID'] = 161000059,
		['parameter1'] = {20021,36,28,63,90,1},
		['parameter2'] = ''
		},
	[161000060] = {
		['ID'] = 161000060,
		['parameter1'] = {20022,90,28,63,-90,1},
		['parameter2'] = ''
		},
	[161000061] = {
		['ID'] = 161000061,
		['parameter1'] = {20022,36,28,63,90,1},
		['parameter2'] = ''
		},
	[161000062] = {
		['ID'] = 161000062,
		['parameter1'] = {20021,74,27,63,0,0.5},
		['parameter2'] = ''
		},
	[161000063] = {
		['ID'] = 161000063,
		['parameter1'] = {20021,52,27,64,90,0.5},
		['parameter2'] = ''
		},
	[161000064] = {
		['ID'] = 161000064,
		['parameter1'] = {20022,74,27,63,0,0.5},
		['parameter2'] = ''
		},
	[161000065] = {
		['ID'] = 161000065,
		['parameter1'] = {20022,52,27,64,90,0.5},
		['parameter2'] = ''
		},
	[161000066] = {
		['ID'] = 161000066,
		['parameter1'] = {45},
		['parameter2'] = ''
		},
	[161000067] = {
		['ID'] = 161000067,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000068] = {
		['ID'] = 161000068,
		['parameter1'] = {151000027,151000028,151000029},
		['parameter2'] = ''
		},
	[161000069] = {
		['ID'] = 161000069,
		['parameter1'] = {151000027,151000028,151000029},
		['parameter2'] = ''
		},
	[161000070] = {
		['ID'] = 161000070,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000071] = {
		['ID'] = 161000071,
		['parameter1'] = {20021,63,27,63,0,90,28,63,0,36,28,63,0},
		['parameter2'] = ''
		},
	[161000072] = {
		['ID'] = 161000072,
		['parameter1'] = {20022,63,27,63,0,90,28,63,0,36,28,63,0},
		['parameter2'] = ''
		},
	[161000073] = {
		['ID'] = 161000073,
		['parameter1'] = {6},
		['parameter2'] = ''
		},
	[161000074] = {
		['ID'] = 161000074,
		['parameter1'] = {},
		['parameter2'] = '在篝火旁边即可获得经验'
		},
	[161000075] = {
		['ID'] = 161000075,
		['parameter1'] = {-100,100},
		['parameter2'] = ''
		},
	[161000076] = {
		['ID'] = 161000076,
		['parameter1'] = {114400004,114400009},
		['parameter2'] = ''
		},
	[161000077] = {
		['ID'] = 161000077,
		['parameter1'] = {114400005,114400009},
		['parameter2'] = ''
		},
	[161000078] = {
		['ID'] = 161000078,
		['parameter1'] = {},
		['parameter2'] = '[fb9e40]赏金妖师专精[-]的玩家,完成民间悬赏任务，赏金经验奖励可提高[fb9e40]%s[-]'
		},
	[161000079] = {
		['ID'] = 161000079,
		['parameter1'] = {},
		['parameter2'] = '[fb9e40]惩戒妖师专精[-]的玩家,完成江湖悬赏任务，惩戒经验奖励可提高[fb9e40]%s[-]'
		},
	[161000080] = {
		['ID'] = 161000080,
		['parameter1'] = {},
		['parameter2'] = '[fb9e40]国御妖师专精[-]的玩家,完成官府悬赏任务，国御经验奖励可提高[fb9e40]%s[-]'
		},
	[161000081] = {
		['ID'] = 161000081,
		['parameter1'] = {},
		['parameter2'] = '[ffff00]胜利条件[-]\n率先[fb9e40]击杀30[-]个人'
		},
	[161000082] = {
		['ID'] = 161000082,
		['parameter1'] = {},
		['parameter2'] = '[ffff00]注意地形[-]\n将敌人[fb9e40]击退[-]至悬崖'
		},
	[161000083] = {
		['ID'] = 161000083,
		['parameter1'] = {},
		['parameter2'] = '[ffff00]野怪[-]\n击杀可获得[fb9e40]增益状态[-]'
		},
	[161000084] = {
		['ID'] = 161000084,
		['parameter1'] = {201070039,2},
		['parameter2'] = ''
		},
	[161000085] = {
		['ID'] = 161000085,
		['parameter1'] = {114400006,114400007,114400008},
		['parameter2'] = ''
		},
	[161000086] = {
		['ID'] = 161000086,
		['parameter1'] = {114400006,114400007,114400008},
		['parameter2'] = ''
		},
	[161000087] = {
		['ID'] = 161000087,
		['parameter1'] = {5,2000},
		['parameter2'] = ''
		},
	[161000088] = {
		['ID'] = 161000088,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000089] = {
		['ID'] = 161000089,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000090] = {
		['ID'] = 161000090,
		['parameter1'] = {500},
		['parameter2'] = ''
		},
	[161000091] = {
		['ID'] = 161000091,
		['parameter1'] = {500},
		['parameter2'] = ''
		},
	[161000092] = {
		['ID'] = 161000092,
		['parameter1'] = {},
		['parameter2'] = '%s派惩戒妖师暗杀了%s，并留下一句话：“%s”'
		},
	[161000093] = {
		['ID'] = 161000093,
		['parameter1'] = {},
		['parameter2'] = '%s对你说“%s”'
		},
	[161000094] = {
		['ID'] = 161000094,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000095] = {
		['ID'] = 161000095,
		['parameter1'] = {30,10},
		['parameter2'] = ''
		},
	[161000096] = {
		['ID'] = 161000096,
		['parameter1'] = {500},
		['parameter2'] = ''
		},
	[161000097] = {
		['ID'] = 161000097,
		['parameter1'] = {180},
		['parameter2'] = ''
		},
	[161000098] = {
		['ID'] = 161000098,
		['parameter1'] = {114400020,114400021,114400022},
		['parameter2'] = ''
		},
	[161000099] = {
		['ID'] = 161000099,
		['parameter1'] = {201070039,1},
		['parameter2'] = ''
		},
	[161000100] = {
		['ID'] = 161000100,
		['parameter1'] = {-5,5},
		['parameter2'] = ''
		},
	[161000101] = {
		['ID'] = 161000101,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000102] = {
		['ID'] = 161000102,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000103] = {
		['ID'] = 161000103,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000104] = {
		['ID'] = 161000104,
		['parameter1'] = {201070039,2},
		['parameter2'] = ''
		},
	[161000105] = {
		['ID'] = 161000105,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000106] = {
		['ID'] = 161000106,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000107] = {
		['ID'] = 161000107,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000108] = {
		['ID'] = 161000108,
		['parameter1'] = {5000},
		['parameter2'] = ''
		},
	[161000109] = {
		['ID'] = 161000109,
		['parameter1'] = {2,1000},
		['parameter2'] = ''
		},
	[161000110] = {
		['ID'] = 161000110,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000111] = {
		['ID'] = 161000111,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000112] = {
		['ID'] = 161000112,
		['parameter1'] = {10000},
		['parameter2'] = ''
		},
	[161000113] = {
		['ID'] = 161000113,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000114] = {
		['ID'] = 161000114,
		['parameter1'] = {},
		['parameter2'] = '每天可领取10组任务，每组任务包含3个子任务，[fb9e40]赏金专精[-]可额外提高[fb9e40]%s赏金经验[-]'
		},
	[161000115] = {
		['ID'] = 161000115,
		['parameter1'] = {},
		['parameter2'] = '[fb9e40]惩戒妖师专精[-]可额外提高[fb9e40]%s惩戒经验[-]'
		},
	[161000116] = {
		['ID'] = 161000116,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000117] = {
		['ID'] = 161000117,
		['parameter1'] = {10000},
		['parameter2'] = ''
		},
	[161000118] = {
		['ID'] = 161000118,
		['parameter1'] = {201040001,1},
		['parameter2'] = ''
		},
	[161000119] = {
		['ID'] = 161000119,
		['parameter1'] = {60,600,60},
		['parameter2'] = ''
		},
	[161000120] = {
		['ID'] = 161000120,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000121] = {
		['ID'] = 161000121,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000122] = {
		['ID'] = 161000122,
		['parameter1'] = {7},
		['parameter2'] = ''
		},
	[161000123] = {
		['ID'] = 161000123,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000124] = {
		['ID'] = 161000124,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000125] = {
		['ID'] = 161000125,
		['parameter1'] = {114400003,114400002},
		['parameter2'] = ''
		},
	[161000126] = {
		['ID'] = 161000126,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000127] = {
		['ID'] = 161000127,
		['parameter1'] = {1,10},
		['parameter2'] = ''
		},
	[161000128] = {
		['ID'] = 161000128,
		['parameter1'] = {8,1},
		['parameter2'] = ''
		},
	[161000129] = {
		['ID'] = 161000129,
		['parameter1'] = {55},
		['parameter2'] = ''
		},
	[161000130] = {
		['ID'] = 161000130,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000131] = {
		['ID'] = 161000131,
		['parameter1'] = {20,114400009},
		['parameter2'] = ''
		},
	[161000132] = {
		['ID'] = 161000132,
		['parameter1'] = {49},
		['parameter2'] = ''
		},
	[161000133] = {
		['ID'] = 161000133,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000134] = {
		['ID'] = 161000134,
		['parameter1'] = {},
		['parameter2'] = '升级可提升帮派成员上限，增加各级官员数量，提升其他建筑等级'
		},
	[161000135] = {
		['ID'] = 161000135,
		['parameter1'] = {},
		['parameter2'] = '升级可提升帮派资金、帮派木材储存上限，可提高帮派每日福利数量'
		},
	[161000136] = {
		['ID'] = 161000136,
		['parameter1'] = {},
		['parameter2'] = '升级可增加帮贡商店中的道具种类'
		},
	[161000137] = {
		['ID'] = 161000137,
		['parameter1'] = {},
		['parameter2'] = '升级可提升帮派技能的可研发等级'
		},
	[161000138] = {
		['ID'] = 161000138,
		['parameter1'] = {},
		['parameter2'] = '帮派成员上限：%s:帮派增加副帮主职位%s个:帮派增加长老职位%s个'
		},
	[161000139] = {
		['ID'] = 161000139,
		['parameter1'] = {},
		['parameter2'] = '帮派资金上限：%s:帮派木材上限：%s:每日可领银两：%s'
		},
	[161000140] = {
		['ID'] = 161000140,
		['parameter1'] = {},
		['parameter2'] = '帮派商店商品数量：%s'
		},
	[161000141] = {
		['ID'] = 161000141,
		['parameter1'] = {},
		['parameter2'] = '帮派技能研发等级：%s'
		},
	[161000142] = {
		['ID'] = 161000142,
		['parameter1'] = {201070045,201070046,201070047},
		['parameter2'] = ''
		},
	[161000145] = {
		['ID'] = 161000145,
		['parameter1'] = {},
		['parameter2'] = '每天24点扣除100点人气，人气不足帮派将自动解散。帮派等级越高所需人气越多。完成帮派活动可增加人气。'
		},
	[161000146] = {
		['ID'] = 161000146,
		['parameter1'] = {},
		['parameter2'] = '每天24点将扣除1000点帮派资金作为维护费用，若帮派资金不足以支付维护费用，则停止发放福利。帮派等级越高所需维护费用越多。'
		},
	[161000147] = {
		['ID'] = 161000147,
		['parameter1'] = {10016},
		['parameter2'] = ''
		},
	[161000148] = {
		['ID'] = 161000148,
		['parameter1'] = {},
		['parameter2'] = '热烈欢迎%s加入我们的大家庭，简直是如虎添翼！！'
		},
	[161000149] = {
		['ID'] = 161000149,
		['parameter1'] = {},
		['parameter2'] = '帮主%s上线啦，大家速来围观~'
		},
	[161000150] = {
		['ID'] = 161000150,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000151] = {
		['ID'] = 161000151,
		['parameter1'] = {500},
		['parameter2'] = ''
		},
	[161000152] = {
		['ID'] = 161000152,
		['parameter1'] = {2500},
		['parameter2'] = ''
		},
	[161000153] = {
		['ID'] = 161000153,
		['parameter1'] = {3,6},
		['parameter2'] = ''
		},
	[161000154] = {
		['ID'] = 161000154,
		['parameter1'] = {},
		['parameter2'] = '职位与权限\n\n帮主：职位任免、建筑升级、开启报名活动、请离帮派、招募成员、设置公告\n副帮主：开启报名活动、请离帮派、招募成员、设置公告\n长老：招募成员、设置公告\n\n\n资源介绍\n\n帮派资金：帮派拥有的财富，可用于帮派建筑升级、帮派日常维护、特殊活动开启\n帮派建筑令：帮派拥有的资源，可用于帮派建筑升级\n帮派贡献：帮派成员为帮派做出贡献的证明，可以在帮贡商店兑换物品，学习升级帮派技能'
		},
	[161000155] = {
		['ID'] = 161000155,
		['parameter1'] = {},
		['parameter2'] = '退出帮派后，技能暂时失效，直到重新加入帮派'
		},
	[161000156] = {
		['ID'] = 161000156,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000157] = {
		['ID'] = 161000157,
		['parameter1'] = {6},
		['parameter2'] = ''
		},
	[161000158] = {
		['ID'] = 161000158,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000159] = {
		['ID'] = 161000159,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000160] = {
		['ID'] = 161000160,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000161] = {
		['ID'] = 161000161,
		['parameter1'] = {6},
		['parameter2'] = ''
		},
	[161000162] = {
		['ID'] = 161000162,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000163] = {
		['ID'] = 161000163,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000164] = {
		['ID'] = 161000164,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000165] = {
		['ID'] = 161000165,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000166] = {
		['ID'] = 161000166,
		['parameter1'] = {},
		['parameter2'] = '快来加入我们吧~~携手共同建设属于我们的家园~~'
		},
	[161000167] = {
		['ID'] = 161000167,
		['parameter1'] = {},
		['parameter2'] = '欢迎加入~~~'
		},
	[161000168] = {
		['ID'] = 161000168,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000169] = {
		['ID'] = 161000169,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000170] = {
		['ID'] = 161000170,
		['parameter1'] = {15},
		['parameter2'] = ''
		},
	[161000171] = {
		['ID'] = 161000171,
		['parameter1'] = {1000,1,1000000,10},
		['parameter2'] = ''
		},
	[161000172] = {
		['ID'] = 161000172,
		['parameter1'] = {},
		['parameter2'] = '生活技能说明'
		},
	[161000173] = {
		['ID'] = 161000173,
		['parameter1'] = {},
		['parameter2'] = '开放条件：角色≥30级开放生活技能，可以炼药、烹饪\n技能效果：消耗精力，可以随机产出已解锁的药剂、菜肴\n技能升级：技能等级每提升到一定等级，将有机会产出更高等级的药剂、菜肴\n①普通升级：消耗帮贡、银币提升熟练度\n②技能书升级：1-59级可使用学徒手册（100熟练度），60-100级使用大师手册（500熟练度）'
		},
	[161000174] = {
		['ID'] = 161000174,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000175] = {
		['ID'] = 161000175,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000176] = {
		['ID'] = 161000176,
		['parameter1'] = {9000000},
		['parameter2'] = ''
		},
	[161000177] = {
		['ID'] = 161000177,
		['parameter1'] = {500},
		['parameter2'] = ''
		},
	[161000178] = {
		['ID'] = 161000178,
		['parameter1'] = {20030,90,28,63,-90,1},
		['parameter2'] = ''
		},
	[161000179] = {
		['ID'] = 161000179,
		['parameter1'] = {20030,36,28,63,90,1},
		['parameter2'] = ''
		},
	[161000180] = {
		['ID'] = 161000180,
		['parameter1'] = {20031,90,28,63,-90,1},
		['parameter2'] = ''
		},
	[161000181] = {
		['ID'] = 161000181,
		['parameter1'] = {20031,36,28,63,90,1},
		['parameter2'] = ''
		},
	[161000182] = {
		['ID'] = 161000182,
		['parameter1'] = {20031,63,28,85,0,1},
		['parameter2'] = ''
		},
	[161000183] = {
		['ID'] = 161000183,
		['parameter1'] = {20031,63,28,42,90,1},
		['parameter2'] = ''
		},
	[161000184] = {
		['ID'] = 161000184,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000185] = {
		['ID'] = 161000185,
		['parameter1'] = {180},
		['parameter2'] = ''
		},
	[161000186] = {
		['ID'] = 161000186,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000187] = {
		['ID'] = 161000187,
		['parameter1'] = {120},
		['parameter2'] = ''
		},
	[161000188] = {
		['ID'] = 161000188,
		['parameter1'] = {300},
		['parameter2'] = ''
		},
	[161000189] = {
		['ID'] = 161000189,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000190] = {
		['ID'] = 161000190,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000191] = {
		['ID'] = 161000191,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000192] = {
		['ID'] = 161000192,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000193] = {
		['ID'] = 161000193,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000194] = {
		['ID'] = 161000194,
		['parameter1'] = {},
		['parameter2'] = '[ffd05e]帮派预赛[-]活动已开始，是否前往参加？'
		},
	[161000195] = {
		['ID'] = 161000195,
		['parameter1'] = {},
		['parameter2'] = '[ffd05e]帮派决赛[-]活动已开始，是否前往参加？'
		},
	[161000196] = {
		['ID'] = 161000196,
		['parameter1'] = {},
		['parameter2'] = '帮主[ffd05e]%s[-]召集大家参与帮战，是否前往？'
		},
	[161000197] = {
		['ID'] = 161000197,
		['parameter1'] = {},
		['parameter2'] = '进入活动准备区需退出当前队伍，是否退队进入？'
		},
	[161000198] = {
		['ID'] = 161000198,
		['parameter1'] = {},
		['parameter2'] = '该轮未匹配到合适对手，自动获胜！\n\n[ffd05e]积分+%s，帮贡+%s，帮会资金+%s[-]'
		},
	[161000199] = {
		['ID'] = 161000199,
		['parameter1'] = {1000,10000},
		['parameter2'] = ''
		},
	[161000200] = {
		['ID'] = 161000200,
		['parameter1'] = {201070050,1,201070056,1},
		['parameter2'] = ''
		},
	[161000201] = {
		['ID'] = 161000201,
		['parameter1'] = {5,30,5},
		['parameter2'] = ''
		},
	[161000202] = {
		['ID'] = 161000202,
		['parameter1'] = {115300003,115300004},
		['parameter2'] = ''
		},
	[161000203] = {
		['ID'] = 161000203,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000204] = {
		['ID'] = 161000204,
		['parameter1'] = {201010004},
		['parameter2'] = ''
		},
	[161000205] = {
		['ID'] = 161000205,
		['parameter1'] = {100},
		['parameter2'] = ''
		},
	[161000206] = {
		['ID'] = 161000206,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000207] = {
		['ID'] = 161000207,
		['parameter1'] = {1,5,10,50},
		['parameter2'] = ''
		},
	[161000208] = {
		['ID'] = 161000208,
		['parameter1'] = {1,8,20,10},
		['parameter2'] = ''
		},
	[161000209] = {
		['ID'] = 161000209,
		['parameter1'] = {-1,0,10,6},
		['parameter2'] = ''
		},
	[161000210] = {
		['ID'] = 161000210,
		['parameter1'] = {0,4,15,8},
		['parameter2'] = ''
		},
	[161000211] = {
		['ID'] = 161000211,
		['parameter1'] = {2,1,10},
		['parameter2'] = ''
		},
	[161000212] = {
		['ID'] = 161000212,
		['parameter1'] = {6,3},
		['parameter2'] = ''
		},
	[161000213] = {
		['ID'] = 161000213,
		['parameter1'] = {1,5,10,50},
		['parameter2'] = ''
		},
	[161000214] = {
		['ID'] = 161000214,
		['parameter1'] = {2,20,10},
		['parameter2'] = ''
		},
	[161000215] = {
		['ID'] = 161000215,
		['parameter1'] = {1,15,8},
		['parameter2'] = ''
		},
	[161000216] = {
		['ID'] = 161000216,
		['parameter1'] = {0,10,6},
		['parameter2'] = ''
		},
	[161000217] = {
		['ID'] = 161000217,
		['parameter1'] = {-1,5,4},
		['parameter2'] = ''
		},
	[161000218] = {
		['ID'] = 161000218,
		['parameter1'] = {1,1,2,50},
		['parameter2'] = ''
		},
	[161000219] = {
		['ID'] = 161000219,
		['parameter1'] = {151000041,151000040,151000043,151000042},
		['parameter2'] = ''
		},
	[161000220] = {
		['ID'] = 161000220,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000221] = {
		['ID'] = 161000221,
		['parameter1'] = {},
		['parameter2'] = '我在%s场景中寻宝，误将封印破除，释放远古魔神，勇士们快来相助！{team:%lld:前去相助 }'
		},
	[161000222] = {
		['ID'] = 161000222,
		['parameter1'] = {},
		['parameter2'] = '我在%s场景中寻宝，不小心打开了上古秘境，侠士们快来帮忙避免邪魔入侵！{team:%lld:前去相助 }'
		},
	[161000223] = {
		['ID'] = 161000223,
		['parameter1'] = {103,20.16077,-75,-90},
		['parameter2'] = ''
		},
	[161000224] = {
		['ID'] = 161000224,
		['parameter1'] = {100.7,19.4,-76.5,0,154000015},
		['parameter2'] = ''
		},
	[161000225] = {
		['ID'] = 161000225,
		['parameter1'] = {100,10,10,1000,3,3000},
		['parameter2'] = ''
		},
	[161000229] = {
		['ID'] = 161000229,
		['parameter1'] = {5000},
		['parameter2'] = ''
		},
	[161000230] = {
		['ID'] = 161000230,
		['parameter1'] = {151001013,151001023,151001025,151001027,151001029,151005072,151005074,151005076,151005078,151005080},
		['parameter2'] = ''
		},
	[161000231] = {
		['ID'] = 161000231,
		['parameter1'] = {151001014,151001024,151001026,151001028,151001030,151005071,151005073,151005075,151005077,151005079},
		['parameter2'] = ''
		},
	[161000232] = {
		['ID'] = 161000232,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000233] = {
		['ID'] = 161000233,
		['parameter1'] = {7000},
		['parameter2'] = ''
		},
	[161000234] = {
		['ID'] = 161000234,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000235] = {
		['ID'] = 161000235,
		['parameter1'] = {50},
		['parameter2'] = ''
		},
	[161000236] = {
		['ID'] = 161000236,
		['parameter1'] = {50},
		['parameter2'] = ''
		},
	[161000237] = {
		['ID'] = 161000237,
		['parameter1'] = {5},
		['parameter2'] = ''
		},
	[161000238] = {
		['ID'] = 161000238,
		['parameter1'] = {201010002,100},
		['parameter2'] = ''
		},
	[161000239] = {
		['ID'] = 161000239,
		['parameter1'] = {},
		['parameter2'] = '阁下武学，有待磨练。'
		},
	[161000240] = {
		['ID'] = 161000240,
		['parameter1'] = {},
		['parameter2'] = '唉，无敌就是寂寞！'
		},
	[161000241] = {
		['ID'] = 161000241,
		['parameter1'] = {},
		['parameter2'] = '班门弄斧，贻笑大方！'
		},
	[161000242] = {
		['ID'] = 161000242,
		['parameter1'] = {},
		['parameter2'] = '屡败屡战，江湖上终究会有你的传说。'
		},
	[161000243] = {
		['ID'] = 161000243,
		['parameter1'] = {},
		['parameter2'] = '胜败乃江湖常事，再来一场！'
		},
	[161000244] = {
		['ID'] = 161000244,
		['parameter1'] = {},
		['parameter2'] = '方才我喝了杯茶。。。'
		},
	[161000245] = {
		['ID'] = 161000245,
		['parameter1'] = {},
		['parameter2'] = '十年之后，定当上门拜会！'
		},
	[161000246] = {
		['ID'] = 161000246,
		['parameter1'] = {},
		['parameter2'] = '今日可算是遇上对手了！'
		},
	[161000247] = {
		['ID'] = 161000247,
		['parameter1'] = {1,3,4},
		['parameter2'] = ''
		},
	[161000248] = {
		['ID'] = 161000248,
		['parameter1'] = {10,10},
		['parameter2'] = ''
		},
	[161000249] = {
		['ID'] = 161000249,
		['parameter1'] = {240130014},
		['parameter2'] = ''
		},
	[161000250] = {
		['ID'] = 161000250,
		['parameter1'] = {240130015},
		['parameter2'] = ''
		},
	[161000251] = {
		['ID'] = 161000251,
		['parameter1'] = {201070049,20,201010001,50000},
		['parameter2'] = ''
		},
	[161000252] = {
		['ID'] = 161000252,
		['parameter1'] = {77,300},
		['parameter2'] = ''
		},
	[161000253] = {
		['ID'] = 161000253,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000254] = {
		['ID'] = 161000254,
		['parameter1'] = {40},
		['parameter2'] = ''
		},
	[161000255] = {
		['ID'] = 161000255,
		['parameter1'] = {60},
		['parameter2'] = ''
		},
	[161000256] = {
		['ID'] = 161000256,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000257] = {
		['ID'] = 161000257,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000258] = {
		['ID'] = 161000258,
		['parameter1'] = {},
		['parameter2'] = '装备附魔说明'
		},
	[161000259] = {
		['ID'] = 161000259,
		['parameter1'] = {},
		['parameter2'] = '开放条件：装备满足炼星条件\n附魔效果：可增加装备属性\n附魔消耗：每次附魔需消耗魔石和5000银币'
		},
	[161000260] = {
		['ID'] = 161000260,
		['parameter1'] = {},
		['parameter2'] = '已发现[eb5032]【%s】[-]，快来助我'
		},
	[161000261] = {
		['ID'] = 161000261,
		['parameter1'] = {2},
		['parameter2'] = ''
		},
	[161000262] = {
		['ID'] = 161000262,
		['parameter1'] = {},
		['parameter2'] = '伙伴说明'
		},
	[161000263] = {
		['ID'] = 161000263,
		['parameter1'] = {},
		['parameter2'] = '1.伙伴品质\n不同同伴之间的武功高低有所不同，综合能力排名由高至低一次是 SSS级、SS级、S级、A级、B级、C级。\n2.伙伴性格\n伙伴性格主要影响伙伴战斗行为。\n3.护主技能\n每个同伴天生都会自带一个“护主技能”且不能被替换，护主技能随着同伴战力的提升而自动提升等级，上阵同伴的护主技能直接对角色加成。\n4.怒气技能\n每个同伴天生都会自带一个“怒气技能”且不能被替换，怒气技能为角色主动使用技能，击杀怪物可以获得一定怒气值，怒气值满后可以主动释放怒气技能。'
		},
	[161000264] = {
		['ID'] = 161000264,
		['parameter1'] = {},
		['parameter2'] = '八卦洗练说明'
		},
	[161000265] = {
		['ID'] = 161000265,
		['parameter1'] = {},
		['parameter2'] = '开放条件：佩戴中的八卦牌\n洗练效果：可对当前八卦的副属性进行重置\n附魔消耗：每次洗练需消耗炼星石、星辰石和10000银币'
		},
	[161000266] = {
		['ID'] = 161000266,
		['parameter1'] = {},
		['parameter2'] = '八卦炼星说明'
		},
	[161000267] = {
		['ID'] = 161000267,
		['parameter1'] = {},
		['parameter2'] = '开放条件：佩戴中的八卦牌\n炼星效果：可提升当前八卦的主属性\n炼星消耗：每次炼星需消耗八卦碎片、星辰石和10000银币\n特殊说明：当8件八卦牌的炼星等级均达到一定星级后，会激活装备的炼星套装效果。炼星的套装效果可以大幅度增加玩家的属性'
		},
	[161000268] = {
		['ID'] = 161000268,
		['parameter1'] = {},
		['parameter2'] = '八卦重铸说明'
		},
	[161000269] = {
		['ID'] = 161000269,
		['parameter1'] = {},
		['parameter2'] = '开放条件：佩戴中的八卦牌\n重铸效果：重置主属性的基础值\n重铸消耗：每次炼星需消耗八卦碎片、炼星石和10000银币'
		},
	[161000270] = {
		['ID'] = 161000270,
		['parameter1'] = {},
		['parameter2'] = '提升%s点%s'
		},
	[161000271] = {
		['ID'] = 161000271,
		['parameter1'] = {},
		['parameter2'] = '%s发布了对%s的通缉，帮会各位义士可以前往妖师客栈”惩戒”界面参与悬赏！快速前往'
		},
	[161000272] = {
		['ID'] = 161000272,
		['parameter1'] = {1,20},
		['parameter2'] = ''
		},
	[161000273] = {
		['ID'] = 161000273,
		['parameter1'] = {152000052},
		['parameter2'] = ''
		},
	[161000274] = {
		['ID'] = 161000274,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000275] = {
		['ID'] = 161000275,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000276] = {
		['ID'] = 161000276,
		['parameter1'] = {1},
		['parameter2'] = ''
		},
	[161000277] = {
		['ID'] = 161000277,
		['parameter1'] = {0.25},
		['parameter2'] = ''
		},
	[161000278] = {
		['ID'] = 161000278,
		['parameter1'] = {2},
		['parameter2'] = ''
		},
	[161000279] = {
		['ID'] = 161000279,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		},
	[161000280] = {
		['ID'] = 161000280,
		['parameter1'] = {2},
		['parameter2'] = ''
		},
	[161000281] = {
		['ID'] = 161000281,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000282] = {
		['ID'] = 161000282,
		['parameter1'] = {75},
		['parameter2'] = ''
		},
	[161000283] = {
		['ID'] = 161000283,
		['parameter1'] = {1500},
		['parameter2'] = ''
		},
	[161000284] = {
		['ID'] = 161000284,
		['parameter1'] = {0.2},
		['parameter2'] = ''
		},
	[161000285] = {
		['ID'] = 161000285,
		['parameter1'] = {13},
		['parameter2'] = ''
		},
	[161000286] = {
		['ID'] = 161000286,
		['parameter1'] = {1900},
		['parameter2'] = ''
		},
	[161000287] = {
		['ID'] = 161000287,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000288] = {
		['ID'] = 161000288,
		['parameter1'] = {1500},
		['parameter2'] = ''
		},
	[161000289] = {
		['ID'] = 161000289,
		['parameter1'] = {250},
		['parameter2'] = ''
		},
	[161000290] = {
		['ID'] = 161000290,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		},
	[161000291] = {
		['ID'] = 161000291,
		['parameter1'] = {75},
		['parameter2'] = ''
		},
	[161000292] = {
		['ID'] = 161000292,
		['parameter1'] = {1500},
		['parameter2'] = ''
		},
	[161000293] = {
		['ID'] = 161000293,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		},
	[161000294] = {
		['ID'] = 161000294,
		['parameter1'] = {},
		['parameter2'] = '给你赠送了一件礼物，快去好友消息中查看吧~'
		},
	[161000295] = {
		['ID'] = 161000295,
		['parameter1'] = {1,1,20,30},
		['parameter2'] = ''
		},
	[161000296] = {
		['ID'] = 161000296,
		['parameter1'] = {},
		['parameter2'] = '商城说明'
		},
	[161000297] = {
		['ID'] = 161000297,
		['parameter1'] = {},
		['parameter2'] = '商城说明商城说明商城说明商城说明商城说明商城说明商城说明'
		},
	[161000298] = {
		['ID'] = 161000298,
		['parameter1'] = {201060031,50,10000},
		['parameter2'] = ''
		},
	[161000299] = {
		['ID'] = 161000299,
		['parameter1'] = {201060032,50,10000},
		['parameter2'] = ''
		},
	[161000300] = {
		['ID'] = 161000300,
		['parameter1'] = {},
		['parameter2'] = '神曜合成说明'
		},
	[161000301] = {
		['ID'] = 161000301,
		['parameter1'] = {},
		['parameter2'] = '合成条件：神曜值>=50\n合成方式：点击左侧神曜石列表放入神曜石\n合成消耗：每次合成需消耗已选神曜石和10000银币'
		},
	[161000302] = {
		['ID'] = 161000302,
		['parameter1'] = {180000001},
		['parameter2'] = ''
		},
	[161000303] = {
		['ID'] = 161000303,
		['parameter1'] = {30},
		['parameter2'] = ''
		},
	[161000304] = {
		['ID'] = 161000304,
		['parameter1'] = {},
		['parameter2'] = '御气道说明'
		},
	[161000305] = {
		['ID'] = 161000305,
		['parameter1'] = {},
		['parameter2'] = '哈哈哈哈哈哈'
		},
	[161000306] = {
		['ID'] = 161000306,
		['parameter1'] = {},
		['parameter2'] = '冲穴说明'
		},
	[161000307] = {
		['ID'] = 161000307,
		['parameter1'] = {},
		['parameter2'] = '哈哈哈哈哈哈'
		},
	[161000308] = {
		['ID'] = 161000308,
		['parameter1'] = {201060031,50},
		['parameter2'] = ''
		},
	[161000309] = {
		['ID'] = 161000309,
		['parameter1'] = {232000001},
		['parameter2'] = ''
		},
	[161000310] = {
		['ID'] = 161000310,
		['parameter1'] = {155000028,152020001},
		['parameter2'] = ''
		},
	[161000311] = {
		['ID'] = 161000311,
		['parameter1'] = {2,80000,3,8000,16,5000},
		['parameter2'] = ''
		},
	[161000312] = {
		['ID'] = 161000312,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000313] = {
		['ID'] = 161000313,
		['parameter1'] = {20035,100},
		['parameter2'] = ''
		},
	[161000314] = {
		['ID'] = 161000314,
		['parameter1'] = {100,80,120},
		['parameter2'] = ''
		},
	[161000315] = {
		['ID'] = 161000315,
		['parameter1'] = {20,40},
		['parameter2'] = ''
		},
	[161000316] = {
		['ID'] = 161000316,
		['parameter1'] = {20043},
		['parameter2'] = ''
		},
	[161000317] = {
		['ID'] = 161000317,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000318] = {
		['ID'] = 161000318,
		['parameter1'] = {},
		['parameter2'] = '本次帮派战预赛已经结束，感谢各帮派成员的踊跃参与，活动奖励将通过邮件发送给各参战成员，请注意查收！'
		},
	[161000319] = {
		['ID'] = 161000319,
		['parameter1'] = {},
		['parameter2'] = '本次帮派战决赛已经结束，感谢各帮派成员的踊跃参与，活动奖励将通过邮件发送给各参战成员，请注意查收！'
		},
	[161000320] = {
		['ID'] = 161000320,
		['parameter1'] = {201010009,100},
		['parameter2'] = ''
		},
	[161000321] = {
		['ID'] = 161000321,
		['parameter1'] = {201010009,10},
		['parameter2'] = ''
		},
	[161000322] = {
		['ID'] = 161000322,
		['parameter1'] = {20},
		['parameter2'] = ''
		},
	[161000323] = {
		['ID'] = 161000323,
		['parameter1'] = {10},
		['parameter2'] = ''
		},
	[161000324] = {
		['ID'] = 161000324,
		['parameter1'] = {},
		['parameter2'] = '斗法场奖励说明'
		},
	[161000325] = {
		['ID'] = 161000325,
		['parameter1'] = {},
		['parameter2'] = '斗法场奖励说明'
		},
	[161000326] = {
		['ID'] = 161000326,
		['parameter1'] = {201010017,1},
		['parameter2'] = ''
		},
	[161000327] = {
		['ID'] = 161000327,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000328] = {
		['ID'] = 161000328,
		['parameter1'] = {3},
		['parameter2'] = ''
		},
	[161000329] = {
		['ID'] = 161000329,
		['parameter1'] = {0.5},
		['parameter2'] = ''
		}
	}
return ParameterTable
