local TransferPointTable = {
	[155000001] = {
		['ID'] = 155000001,	--索引
		['NameId'] = '枫华林传送点',	--传送名称
		['limitLevel'] = 1,	--进入最低等级限制
		['MapId'] = {10000}	--目标地图ID
		},
	[155000002] = {
		['ID'] = 155000002,
		['NameId'] = '云笑寺',
		['limitLevel'] = 1,
		['MapId'] = {10011}
		},
	[155000003] = {
		['ID'] = 155000003,
		['NameId'] = 'PVP地图传送点',
		['limitLevel'] = 1,
		['MapId'] = {10001}
		},
	[155000004] = {
		['ID'] = 155000004,
		['NameId'] = '凡浅镇',
		['limitLevel'] = 1,
		['MapId'] = {10006}
		},
	[155000005] = {
		['ID'] = 155000005,
		['NameId'] = '八宝郡',
		['limitLevel'] = 1,
		['MapId'] = {10007}
		},
	[155000006] = {
		['ID'] = 155000006,
		['NameId'] = '合一湖传送点',
		['limitLevel'] = 1,
		['MapId'] = {10002}
		},
	[155000007] = {
		['ID'] = 155000007,
		['NameId'] = '伏龙国都',
		['limitLevel'] = 1,
		['MapId'] = {10003}
		},
	[155000008] = {
		['ID'] = 155000008,
		['NameId'] = '巨轮边境',
		['limitLevel'] = 1,
		['MapId'] = {10004}
		},
	[155000009] = {
		['ID'] = 155000009,
		['NameId'] = '伏龙边境',
		['limitLevel'] = 1,
		['MapId'] = {10005}
		},
	[155000010] = {
		['ID'] = 155000010,
		['NameId'] = '百花宫',
		['limitLevel'] = 1,
		['MapId'] = {10008}
		},
	[155000011] = {
		['ID'] = 155000011,
		['NameId'] = '千羽国',
		['limitLevel'] = 1,
		['MapId'] = {10009}
		},
	[155000012] = {
		['ID'] = 155000012,
		['NameId'] = '夷神岭',
		['limitLevel'] = 1,
		['MapId'] = {10010}
		},
	[155000013] = {
		['ID'] = 155000013,
		['NameId'] = '皆悦岛',
		['limitLevel'] = 1,
		['MapId'] = {10012}
		},
	[155000014] = {
		['ID'] = 155000014,
		['NameId'] = '巅峰谷',
		['limitLevel'] = 1,
		['MapId'] = {10013}
		},
	[155000015] = {
		['ID'] = 155000015,
		['NameId'] = '副本测试区',
		['limitLevel'] = 1,
		['MapId'] = {10000,71201,57386,97719,0}
		},
	[155000016] = {
		['ID'] = 155000016,
		['NameId'] = '云笑寺中央传送',
		['limitLevel'] = 1,
		['MapId'] = {10011,134594,42213,133726,180}
		},
	[155000017] = {
		['ID'] = 155000017,
		['NameId'] = '云笑寺棋峰传',
		['limitLevel'] = 1,
		['MapId'] = {10011,203017,91432,199387,0}
		},
	[155000018] = {
		['ID'] = 155000018,
		['NameId'] = '凡浅镇传送点',
		['limitLevel'] = 1,
		['MapId'] = {10006,41031,10958,142412,90}
		},
	[155000019] = {
		['ID'] = 155000019,
		['NameId'] = '八宝郡传送点',
		['limitLevel'] = 1,
		['MapId'] = {10007,120595,42739,483533,180}
		},
	[155000020] = {
		['ID'] = 155000020,
		['NameId'] = '云笑寺传送点',
		['limitLevel'] = 1,
		['MapId'] = {10011,196778,30363,78321,-130}
		},
	[155000021] = {
		['ID'] = 155000021,
		['NameId'] = '虚空刃',
		['limitLevel'] = 1,
		['MapId'] = {10006,92414,10000,65826,-90}
		},
	[155000022] = {
		['ID'] = 155000022,
		['NameId'] = '云笑寺传送点',
		['limitLevel'] = 1,
		['MapId'] = {10011,196778,30363,78321,-130}
		},
	[155000023] = {
		['ID'] = 155000023,
		['NameId'] = '八宝郡传送点',
		['limitLevel'] = 1,
		['MapId'] = {10007,73960,12547,279264,90}
		},
	[155000024] = {
		['ID'] = 155000024,
		['NameId'] = '凡浅镇墓穴',
		['limitLevel'] = 1,
		['MapId'] = {10014}
		},
	[155000025] = {
		['ID'] = 155000025,
		['NameId'] = '千羽国风井',
		['limitLevel'] = 1,
		['MapId'] = {10015}
		},
	[155000026] = {
		['ID'] = 155000026,
		['NameId'] = '一眉密室一层',
		['limitLevel'] = 1,
		['MapId'] = {10017}
		},
	[155000027] = {
		['ID'] = 155000027,
		['NameId'] = '进入准备区',
		['limitLevel'] = 1,
		['MapId'] = {20029}
		},
	[155000028] = {
		['ID'] = 155000028,
		['NameId'] = '返回帮派',
		['limitLevel'] = 1,
		['MapId'] = {10016}
		},
	[155000029] = {
		['ID'] = 155000029,
		['NameId'] = '凡浅镇墓穴',
		['limitLevel'] = 1,
		['MapId'] = {20008}
		},
	[155000030] = {
		['ID'] = 155000030,
		['NameId'] = '皆悦岛渡口',
		['limitLevel'] = 1,
		['MapId'] = {10012,270000,21000,109000,135}
		},
	[155000031] = {
		['ID'] = 155000031,
		['NameId'] = '皆悦岛渡口',
		['limitLevel'] = 1,
		['MapId'] = {10012,128890,20000,323200,94}
		}
	}
return TransferPointTable
